{
    "cybertruck1989478200406425806": {
        "content": "Cybertruck FSD navigates busy parking lot in the rain, finds a free spot &amp; parks itself ",
        "author": "cybertruck",
        "date": "2025-11-14T23:39:00.000Z"
    },
    "cybertruck1971663420161511533": {
        "content": "Dog Mode keeps climate running so your pets are safe &amp; comfortable  And Tesla app lets you check in on them remotely ",
        "author": "cybertruck",
        "date": "2025-09-26T19:49:25.000Z"
    },
    "cybertruck1956697915608731754": {
        "content": "Made to roll up my sleeves  – Durable stainless steel that can take a beating – 11,000lbs towing capacity – 120V/240V outlets in the bed – Ability to use as a backup generator via Powershare – Adjustable, self-leveling air suspension – 4-wheel steering + steering by wire for ",
        "author": "cybertruck",
        "date": "2025-08-16T12:41:51.000Z"
    },
    "cybertruck1951198323760660784": {
        "content": "Just letting you know that Cybertruck has the lowest probability of injury &amp; lowest rollover risk of any pickup tested by NHTSA  And I drive myself to help avoid accidents in the first place  Best crash = no crash, but if the worst happens, I’ve got your back ",
        "author": "cybertruck",
        "date": "2025-08-01T08:28:26.000Z"
    },
    "cybertruck1948824388922753092": {
        "content": "Imagine you could road trip for free  Well … inventory Cybertrucks come with 1 year of free Supercharging  Go get back out in the world. Get back out on the road. Do the bucket list trips.  I’ll even drive for you ",
        "author": "cybertruck",
        "date": "2025-07-25T19:15:16.000Z"
    },
    "cybertruck1946198849065812148": {
        "content": "Cybertruck comes standard with a hospital-grade HEPA filter that will protect you and your family from &gt;99.97% of dust, pollen, mold, bacteria&nbsp;&amp; any airborne particle – no matter if you’re off roading or in an environment with bad air quality ",
        "author": "cybertruck",
        "date": "2025-07-18T13:22:18.000Z"
    },
    "cybertruck1942203870739841213": {
        "content": "You can buy a Cybertruck  Or you can continue spending all your money on gas, maintenance &amp; repairs ",
        "author": "cybertruck",
        "date": "2025-07-07T12:47:41.000Z"
    },
    "cybertruck1925570270288650717": {
        "content": "Cybertruck  – Drives itself with FSD Supervised  – Ultra comfortable ride  – Very easy to maneuver (thanks to steer-by-wire &amp; 4 wheel steering)  – Can power whatever you need with outlets in the bed  – Can leave whatever you want in your truck because it comes with lockable ",
        "author": "cybertruck",
        "date": "2025-05-22T15:11:42.000Z"
    },
    "cybertruck1923424702304833930": {
        "content": "No paint, no dents, no problem ",
        "author": "cybertruck",
        "date": "2025-05-16T17:05:59.000Z"
    },
    "cybertruck1912817453718995096": {
        "content": "You'd never know you're driving a truck this big when inside of it  That's the magic of 4-wheel steering + steer-by-wire.  Makes maneuvering super easy ",
        "author": "cybertruck",
        "date": "2025-04-17T10:36:34.000Z"
    }
}