{
    "nasaspox1971645776473280581": {
        "content": "It's been a jam-packed week at NASA as we keep America LEADING in air and space.     10 new astronaut candidates   3 space weather satellites launched   A new name for the Artemis II Orion spacecraft …and more!  Make sure you're following along on  ",
        "author": "nasaspox",
        "date": "2025-09-26T18:39:19.000Z"
    },
    "nasaspox1969107329397170231": {
        "content": "Another week, another step toward winning the second space race.      Safe Cargo Mission to ISS   6,000 planets outside of Milky Way   Deep Space Communications Success   New Artemis Flight Training Course  Keeping America FIRST on the final frontier. ",
        "author": "nasaspox",
        "date": "2025-09-19T18:32:26.000Z"
    },
    "nasaspox1966536029944664389": {
        "content": "Unlocking the Golden Age of exploration here at NASA, one week at a time!    Fly YOUR name to the Moon on Artemis    ",
        "author": "nasaspox",
        "date": "2025-09-12T16:15:00.000Z"
    },
    "nasaspox1964055685291024805": {
        "content": "Laser-focused on Artemis this week as we work to WIN the second space race!   <a dir=\"ltr\" href=\"https://x.com/SecDuffyNASA\" role=\"link\"  style=\"color: rgb(29, 155, 240);\">@SecDuffyNASA</a> ",
        "author": "nasaspox",
        "date": "2025-09-05T19:59:00.000Z"
    },
    "nasaspox1961511923989496296": {
        "content": "Ensuring American dominance on the final frontier this week at NASA:    CRS-33 delivers medical experiments    ",
        "author": "nasaspox",
        "date": "2025-08-29T19:31:00.000Z"
    },
    "nasaspox1958964891089268974": {
        "content": "Hard at work to unlock the Golden Age of innovation this week  ",
        "author": "nasaspox",
        "date": "2025-08-22T18:50:00.000Z"
    },
    "nasaspox1956474110680203650": {
        "content": "Hard at work to keep AMERICA FIRST on the final frontier this week!    Commercial Space EO signing   Artemis II milestones &amp; training   JWST identifies probable new planet   LunaRecycle Challenge   RAVEN aircraft performs wind tunnel tests  Follow along on  ",
        "author": "nasaspox",
        "date": "2025-08-15T21:52:32.000Z"
    },
    "nasaspox1953847044927353102": {
        "content": "Another eventful couple of weeks chasing manifest destiny into the stars!    Lunar Surface Power Directive   Commercial LEO Destinations   New opportunities for our space industry   Crew-11 Launch   Advanced Air Mobility   NISAR satellite launch  Stay tuned for more on ",
        "author": "nasaspox",
        "date": "2025-08-08T15:53:30.000Z"
    }
}