{
    "gdb1987996461846659372": {
        "content": "Welcome  ",
        "author": "gdb",
        "date": "2025-11-10T21:31:06.000Z"
    },
    "sama1987232631680053745": {
        "content": "This is an important one, I think. AI progress and recommendations: ",
        "author": "sama",
        "date": "2025-11-08T18:55:55.000Z"
    },
    "sama1986917979343495650": {
        "content": "The government has played a role in critical infrastructure builds. Our public submission (posted on our blog) shares our thinking and suggests ideas for how the US government can support domestic supply chain/manufacturing.  This is very in line with everything we have heard ",
        "author": "sama",
        "date": "2025-11-07T22:05:36.000Z"
    },
    "deanwball1986822108895191154": {
        "content": null,
        "author": "deanwball",
        "date": null
    },
    "sama1986514377470845007": {
        "content": "I would like to clarify a few things.  First, the obvious one: we do not have or want government guarantees for OpenAI datacenters. We believe that governments should not pick winners or losers, and that taxpayers should not bail out companies that make bad business decisions or ",
        "author": "sama",
        "date": "2025-11-06T19:21:49.000Z"
    },
    "sama1986204243997688184": {
        "content": "A thing often in common among great startup investors, founders, and researchers:  Trading making a lot of small mistakes in exchange for getting a few giant wins.  (Surprisingly many people seem to prefer a few big mistakes in exchange for a lot of small wins.) ",
        "author": "sama",
        "date": "2025-11-05T22:49:28.000Z"
    },
    "sama1985841697067319510": {
        "content": "interesting post from  ",
        "author": "sama",
        "date": "2025-11-04T22:48:50.000Z"
    },
    "sama1985814135784042993": {
        "content": "Codex has transformed how OpenAI builds over the last few months. Have some great upcoming models too.  Amazing work by the team! ",
        "author": "sama",
        "date": "2025-11-04T20:59:19.000Z"
    },
    "sama1985431030430646365": {
        "content": "Very pleased to be working with Amazon to bring a lot more NVIDIA chips online for OpenAI to keep scaling! ",
        "author": "sama",
        "date": "2025-11-03T19:36:59.000Z"
    },
    "sama1985066410859692333": {
        "content": "i helped turn the thing you left for dead into what should be the largest non-profit ever.  you know as well as anyone a structure like what openai has now is required to make that happen. ",
        "author": "sama",
        "date": "2025-11-02T19:28:07.000Z"
    },
    "sama1985066412470325339": {
        "content": "you also wanted tesla to take openai over, no nonprofit at all.  and you said we had a 0% of success.  now you have a great AI company and so do we.  can't we all just move on? ",
        "author": "sama",
        "date": "2025-11-02T19:28:08.000Z"
    },
    "sama1984025727763935585": {
        "content": "GPT-6 will be renamed GPT-6-7, you're welcome ",
        "author": "sama",
        "date": "2025-10-30T22:32:49.000Z"
    },
    "sama1984023663642087831": {
        "content": "A tale in three acts: ",
        "author": "sama",
        "date": "2025-10-30T22:24:37.000Z"
    },
    "sama1984023891879346592": {
        "content": "I really was excited for the car! And I understand delays. But 7.5 years has felt like a long time to wait. ",
        "author": "sama",
        "date": "2025-10-30T22:25:31.000Z"
    },
    "billpeeb1984011952155455596": {
        "content": "we are launching the ability to buy extra gens in sora today. we are doing this for two main reasons:  first, we have been quite amazed by how much our power users want to use sora, and the economics are currently completely unsustainable. we thought 30 free gens/day would be ",
        "author": "billpeeb",
        "date": "2025-10-30T21:38:05.000Z"
    },
    "sama1984002552158154905": {
        "content": "A new security agent called Aardvark: ",
        "author": "sama",
        "date": "2025-10-30T21:00:44.000Z"
    },
    "sama1984001525556097507": {
        "content": "All palaces are temporary palaces  All theories are provisional theories ",
        "author": "sama",
        "date": "2025-10-30T20:56:39.000Z"
    },
    "sama1983998115603734843": {
        "content": "If you want to use more Codex after you hit your subscription limits, you can now buy credits as needed.  This is something we expect to do for compute-intensive features; it will let us keep subscription prices low for most users and let the rest of you go wild. ",
        "author": "sama",
        "date": "2025-10-30T20:43:06.000Z"
    },
    "sama1983910416288809046": {
        "content": "I love the way Tibo and team are so methodically going through every inch of the system to try to track down user feedback. ",
        "author": "sama",
        "date": "2025-10-30T14:54:37.000Z"
    },
    "sama1983584366547829073": {
        "content": "Yesterday we did a livestream. TL;DR:  We have set internal goals of having an automated AI research intern by September of 2026 running on hundreds of thousands of GPUs, and a true automated AI researcher by March of 2028. We may totally fail at this goal, but given the ",
        "author": "sama",
        "date": "2025-10-29T17:19:00.000Z"
    },
    "sama1983584367613243717": {
        "content": "Link here:  ",
        "author": "sama",
        "date": "2025-10-29T17:19:01.000Z"
    },
    "sama1983223056668746218": {
        "content": "California is my home, and I love it here, and when I talked to Attorney General Bonta two weeks ago I made clear that we were not going to do what those other companies do and threaten to leave if sued.  We really wanted to figure this out and are really happy about where it all ",
        "author": "sama",
        "date": "2025-10-28T17:23:17.000Z"
    },
    "sama1983182740666364113": {
        "content": "Jakub and I are going to do a livestream and answer questions today at 10:30 am pacific.  We have a lot of things to talk about--of course we will cover our new corporate structure, but we will also discuss our new goals for research, the evolution of our product offerings, an ",
        "author": "sama",
        "date": "2025-10-28T14:43:05.000Z"
    },
    "joheidecke1982875268818841950": {
        "content": null,
        "author": "joheidecke",
        "date": "2025-10-27T18:21:18.000Z"
    },
    "lulumeservey1982579051815645478": {
        "content": "It is Fidji Simo. ",
        "author": "lulumeservey",
        "date": "2025-10-26T22:44:15.000Z"
    },
    "jasonkwon1981765831488078048": {
        "content": "One of the greatest opportunities in AI safety and security is the chance to help support the creation of new industry verticals that help maximize the benefits and minimize the risks. The technology is moving fast. One of the best ways to keep up is with more technology, more ",
        "author": "jasonkwon",
        "date": "2025-10-24T16:52:48.000Z"
    },
    "valthostech1981716478010274023": {
        "content": null,
        "author": "valthostech",
        "date": null
    },
    "sama1981758298635571477": {
        "content": "ok gl ",
        "author": "sama",
        "date": "2025-10-24T16:22:52.000Z"
    },
    "sama1981494592987156899": {
        "content": "Ari and team are super talented and we can't wait Sky x ChatGPT! ",
        "author": "sama",
        "date": "2025-10-23T22:55:00.000Z"
    },
    "billpeeb1981118483607032050": {
        "content": "sora roadmap update: in the spirit of building this app openly, here's what we're landing soon.  first, more creation tools. character cameos are coming in the next few days: you'll be able to cameo your dog, guinea pig, favorite stuffed toy, and pretty much anything else you ",
        "author": "billpeeb",
        "date": "2025-10-22T22:00:28.000Z"
    },
    "bengoodger1980692301010858350": {
        "content": "When I joined  ",
        "author": "bengoodger",
        "date": "2025-10-21T17:46:58.000Z"
    },
    "sama1980690768391201180": {
        "content": "Our new AI-first web browser, ChatGPT Atlas, is here for macOS.  Please send feedback! Availability on other platforms to follow. ",
        "author": "sama",
        "date": "2025-10-21T17:40:53.000Z"
    },
    "sama1980653675665322109": {
        "content": "10 am livestream today to launch a new product I'm quite excited about! ",
        "author": "sama",
        "date": "2025-10-21T15:13:29.000Z"
    },
    "sebastienbubeck1980311866770653632": {
        "content": "My posts last week created a lot of unnecessary confusion*, so today I would like to do a deep dive on one example to explain why I was so excited. In short, it’s not about AIs discovering new results on their own, but rather how tools like GPT-5 can help researchers navigate, ",
        "author": "sebastienbubeck",
        "date": "2025-10-20T16:35:16.000Z"
    },
    "sama1978539332215681076": {
        "content": "Ok this tweet about upcoming changes to ChatGPT blew up on the erotica point much more than I thought it was going to! It was meant to be just one example of us allowing more user freedom for adults. Here is an effort to better communicate it:  As we have said earlier, we are ",
        "author": "sama",
        "date": "2025-10-15T19:11:50.000Z"
    },
    "sama1978129344598827128": {
        "content": null,
        "author": "sama",
        "date": "2025-10-14T16:02:42.000Z"
    },
    "sama1978300655069450611": {
        "content": "Things have come a long way since the delivery of the DGX-1 9 years ago; amazing to see... ",
        "author": "sama",
        "date": "2025-10-15T03:23:25.000Z"
    },
    "bradlightcap1978116720171643127": {
        "content": "welcome  ",
        "author": "bradlightcap",
        "date": "2025-10-14T15:12:32.000Z"
    },
    "sama1977177505971736675": {
        "content": "Codex is so good, and is going to get so amazing.  I am having a hard time imagining what creating software at the end of 2026 is going to look like. ",
        "author": "sama",
        "date": "2025-10-12T01:00:26.000Z"
    },
    "sama1976799538523292027": {
        "content": "One of the most fun parts of OpenAI is watching people here level up so fast and do such excellent work.  We are operating at a high level across many different disciplines and many of the people doing it have never done it before, and joined us at the beginning of their career. ",
        "author": "sama",
        "date": "2025-10-10T23:58:31.000Z"
    },
    "sama1975185516225278428": {
        "content": "Excited to partner with AMD to use their chips to serve our users!  This is all incremental to our work with NVIDIA (and we plan to increase our NVIDIA purchasing over time).  The world needs much more compute... ",
        "author": "sama",
        "date": "2025-10-06T13:04:58.000Z"
    },
    "sama1974980036454416391": {
        "content": "excited for dev day tomorrow!  got some new stuff to help you build with AI. ",
        "author": "sama",
        "date": "2025-10-05T23:28:28.000Z"
    },
    "billpeeb1974969638300901817": {
        "content": "sora update: cameo and safety improvements inbound!  1. cameo restrictions: we've heard from lots of folks who want to make their cameos available to everyone but retain control over how they're used.  starting today, you can now give instructions to sora that restrict the type ",
        "author": "billpeeb",
        "date": "2025-10-05T22:47:09.000Z"
    },
    "sama1974272833875329113": {
        "content": "Sora update #1: ",
        "author": "sama",
        "date": "2025-10-04T00:38:18.000Z"
    },
    "sebastienbubeck1973977315572154383": {
        "content": "Well, this time it's by Terence Tao himself:  ",
        "author": "sebastienbubeck",
        "date": "2025-10-03T05:04:01.000Z"
    },
    "sama1973381552621887706": {
        "content": "i get the vibe here, but...  we do mostly need the capital for build AI that can do science, and for sure we are focused on AGI with almost all of our research effort.  it is also nice to show people cool new tech/products along the way, make them smile, and hopefully make some ",
        "author": "sama",
        "date": "2025-10-01T13:36:40.000Z"
    },
    "sama1973377760262295959": {
        "content": "it is way less strange to watch a feed full of memes of yourself than i thought it would be.  not sure what to make of this. ",
        "author": "sama",
        "date": "2025-10-01T13:21:36.000Z"
    },
    "sama1973216690516426982": {
        "content": "does feel like this is really starting to happen (in tiny ways) ",
        "author": "sama",
        "date": "2025-10-01T02:41:34.000Z"
    },
    "sama1973215799042252812": {
        "content": "amazing breakthroughs from  ",
        "author": "sama",
        "date": "2025-10-01T02:38:01.000Z"
    },
    "sama1973080473896189959": {
        "content": "lol gj gabriel ",
        "author": "sama",
        "date": "2025-09-30T17:40:17.000Z"
    },
    "sama1973078555274743883": {
        "content": "thanks bill for your leadership and vision on this project; it has been awesome to watch. ",
        "author": "sama",
        "date": "2025-09-30T17:32:40.000Z"
    },
    "sama1973074276765835657": {
        "content": "congrats, liam! ",
        "author": "sama",
        "date": "2025-09-30T17:15:40.000Z"
    },
    "liamfedus1973055380193431965": {
        "content": null,
        "author": "liamfedus",
        "date": null
    },
    "sama1973073987023352250": {
        "content": "We are launching a new app called Sora. This is a combination of a new model called Sora 2, and a new product that makes it easy to create, share, and view videos.  This feels to many of us like the “ChatGPT for creativity” moment, and it feels fun and new. There is something ",
        "author": "sama",
        "date": "2025-09-30T17:14:31.000Z"
    },
    "sama1973074066111148510": {
        "content": "(or here with nicer formatting:  ",
        "author": "sama",
        "date": "2025-09-30T17:14:49.000Z"
    },
    "sama1973072672683684239": {
        "content": "Excited to launch Sora 2! Video models have come a long way; this is a tremendous research achievement.  Sora is also the most fun I've had with a new product in a long time. The iOS app is available in the App Store in the US and Canada; we will expand quickly. ",
        "author": "sama",
        "date": "2025-09-30T17:09:17.000Z"
    },
    "sama1973072675288281312": {
        "content": "I did not expect such fun dynamics to emerge from being able to \"put yourself and your friends in videos\" but I encourage you to check it out!  ChatGPT Pro subscribers can generate with Sora 2 Pro.  Longer post coming in a minute. ",
        "author": "sama",
        "date": "2025-09-30T17:09:18.000Z"
    },
    "sama1973072596322205857": {
        "content": "lol</span> ",
        "author": "sama",
        "date": "2025-09-30T17:08:59.000Z"
    },
    "sama1972993739074523239": {
        "content": "I mostly buy stuff from ChatGPT now, so I am excited for this new feature! ",
        "author": "sama",
        "date": "2025-09-30T11:55:38.000Z"
    },
    "openai1972708279043367238": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "openai1972604360204210600": {
        "content": "Introducing parental controls in ChatGPT.  Now parents and teens can link accounts to automatically get stronger safeguards for teens. Parents also gain tools to adjust features &amp; set limits that work for their family.  Rolling out to all ChatGPT users today on web, mobile soon. ",
        "author": "openai",
        "date": "2025-09-29T10:08:23.000Z"
    },
    "sama1971433413086499044": {
        "content": "Had fun being in Germany to launch a sovereign cloud offering with SAP and Microsoft; important to us to help governments use our frontier models. ",
        "author": "sama",
        "date": "2025-09-26T04:35:27.000Z"
    },
    "sama1971316435365597258": {
        "content": "very important work on a new eval ",
        "author": "sama",
        "date": "2025-09-25T20:50:38.000Z"
    },
    "sama1971297661748953263": {
        "content": "Today we are launching my favorite feature of ChatGPT so far, called Pulse. It is initially available to Pro subscribers.  Pulse works for you overnight, and keeps thinking about your interests, your connected data, your recent chats, and more. Every morning, you get a ",
        "author": "sama",
        "date": "2025-09-25T19:36:02.000Z"
    },
    "fidjissimo1971258542578663829": {
        "content": "AI should do more than just answer questions; it should anticipate your needs and help you reach your goals. That’s what we’re beginning to build, starting with ChatGPT Pulse (rolling out now to Pro, with goal of making it available to everyone over time):  ",
        "author": "fidjissimo",
        "date": "2025-09-25T17:00:35.000Z"
    },
    "sebastienbubeck1970875019803910478": {
        "content": "It's becoming increasingly clear that gpt5 can solve MINOR open math problems, those that would require a day/few days of a good PhD student. Ofc it's not a 100% guarantee, eg below gpt5 solves 3/5 optimization conjectures. Imo full impact of this has yet to be internalized... ",
        "author": "sebastienbubeck",
        "date": "2025-09-24T15:36:36.000Z"
    },
    "sama1970812956733739422": {
        "content": "Progress at our datacenter in Abilene. Fun to visit yesterday! ",
        "author": "sama",
        "date": "2025-09-24T11:29:59.000Z"
    },
    "sama1970484594161098920": {
        "content": "Abundant Intelligence: ",
        "author": "sama",
        "date": "2025-09-23T13:45:11.000Z"
    },
    "sama1970483993486217258": {
        "content": "Grateful to Jensen for the almost-decade of partnership! ",
        "author": "sama",
        "date": "2025-09-23T13:42:48.000Z"
    },
    "sama1969835407421374910": {
        "content": "Over the next few weeks, we are launching some new compute-intensive offerings. Because of the associated costs, some features will initially only be available to Pro subscribers, and some new products will have additional fees.  Our intention remains to drive the cost of ",
        "author": "sama",
        "date": "2025-09-21T18:45:33.000Z"
    },
    "thsottiaux1968825235328631262": {
        "content": "/review now in Codex CLI  Use it to get a quick review from codex on your code changes locally. Will expand a lot in coming days, send Daniel your feedback! ",
        "author": "thsottiaux",
        "date": "2025-09-18T23:51:29.000Z"
    },
    "sama1968851561754300733": {
        "content": "codex usage is up 3x in the past week! ",
        "author": "sama",
        "date": "2025-09-19T01:36:06.000Z"
    },
    "sama1968674357309223020": {
        "content": "As AI capability increases, alignment work becomes much more important.  In this work, we show that a model discovers that it shouldn't be deployed, considers behavior to get deployed anyway, and then realizes it might be a test. ",
        "author": "sama",
        "date": "2025-09-18T13:51:57.000Z"
    },
    "openai1968361701784568200": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "sama1968674371334988283": {
        "content": "AI scheming is a particularly important risk we've been studying. More here: ",
        "author": "sama",
        "date": "2025-09-18T13:52:00.000Z"
    },
    "sama1968674819014004829": {
        "content": "Exciting work from the team in this blog post to reduce scheming, and we look forward to doing much more researcher here. ",
        "author": "sama",
        "date": "2025-09-18T13:53:47.000Z"
    },
    "sama1968474300026859561": {
        "content": "amazing to get all 12 problems correct! ",
        "author": "sama",
        "date": "2025-09-18T00:37:00.000Z"
    },
    "mostafarohani1968360976379703569": {
        "content": null,
        "author": "mostafarohani",
        "date": null
    },
    "sama1968474713430036821": {
        "content": "also, congratulations to all ICPC World Finals contestants--each contestant will receive a full year of chatgpt pro.  we're excited to see what you'll achieve next. ",
        "author": "sama",
        "date": "2025-09-18T00:38:38.000Z"
    },
    "sama1968357219952660668": {
        "content": "Fun to look back at this exploration with Area on the OpenAI brand. This work partially inspired the circle that we use and love in our products. ",
        "author": "sama",
        "date": "2025-09-17T16:51:46.000Z"
    },
    "sama1968316161113882665": {
        "content": "We felt bad about the slowdowns as we were adding GPUs, so we reset everyone's limits to make up for it: ",
        "author": "sama",
        "date": "2025-09-17T14:08:37.000Z"
    },
    "thsottiaux1967996885500928459": {
        "content": "Currently serving gpt-5-codex at degraded speeds, about 2X, due to the very high demand. We are finding GPUs left and right to match demand, we'll keep you posted ",
        "author": "thsottiaux",
        "date": "2025-09-16T16:59:55.000Z"
    },
    "sama1967955739911364693": {
        "content": "Some of our principles are in conflict, so here is what we are going to do: ",
        "author": "sama",
        "date": "2025-09-16T14:16:25.000Z"
    },
    "sama1967956382646223248": {
        "content": "I don't expect that everyone will agree with these tradeoffs, but given the conflict it is important to explain our decisionmaking.  Here is the text:  Some of our principles are in conflict, and we’d like to explain the decisions we are making around a case of tensions between ",
        "author": "sama",
        "date": "2025-09-16T14:18:59.000Z"
    },
    "sama1967954997754335680": {
        "content": "the vibes on codex feel like the first few months of chatgpt.  fun energy! ",
        "author": "sama",
        "date": "2025-09-16T14:13:28.000Z"
    },
    "yacinemtb1967817870039236813": {
        "content": "now that coding's been solved i spend most of my time thinking and thinking is honestly so much harder than writing code ",
        "author": "yacinemtb",
        "date": "2025-09-16T05:08:35.000Z"
    },
    "sama1967789125702140021": {
        "content": "We have updated ChatGPT's personalization page: personality configuration, custom instructions, and memories are now all in one place. Going live over the next couple of days. ",
        "author": "sama",
        "date": "2025-09-16T03:14:21.000Z"
    },
    "sama1967674950502015165": {
        "content": "GPT-5-Codex already ~40% of traffic for codex! should be the majority some time today. ",
        "author": "sama",
        "date": "2025-09-15T19:40:40.000Z"
    },
    "thsottiaux1967642387116945904": {
        "content": "With gpt-5-codex, some will feel that it's the best thing since sliced bread, some will see its quirks.  Personally it is my favorite collaborator for coding, fast for small things, working hard when it matters and a solid jump in produced code quality.  $ codex -m gpt-5-codex ",
        "author": "thsottiaux",
        "date": "2025-09-15T17:31:16.000Z"
    },
    "sama1967650108285259822": {
        "content": "GPT-5-Codex is here: a version of GPT-5 better at agentic coding.  It is faster, smarter, and has new capabilities. Let us know what you think!  The team has been absolutely cooking, very fun to watch. ",
        "author": "sama",
        "date": "2025-09-15T18:01:57.000Z"
    },
    "sama1966899254804574266": {
        "content": "i suspect society was better off with phone call culture than meeting culture ",
        "author": "sama",
        "date": "2025-09-13T16:18:20.000Z"
    },
    "sama1965551055959462105": {
        "content": "first new iphone upgrade i have really wanted in awhile! looks very cool. ",
        "author": "sama",
        "date": "2025-09-09T23:01:04.000Z"
    },
    "sama1965206375287672834": {
        "content": "Jakub and Szymon: ",
        "author": "sama",
        "date": "2025-09-09T00:11:26.000Z"
    },
    "sama1965110064215458055": {
        "content": "i have had the strangest experience reading this: i assume its all fake/bots, even though in this case i know codex growth is really strong and the trend here is real.  i think there are a bunch of things going on: real people have picked up quirks of LLM-speak, the Extremely ",
        "author": "sama",
        "date": "2025-09-08T17:48:43.000Z"
    },
    "sama1964032860664582618": {
        "content": "very requested feature! ",
        "author": "sama",
        "date": "2025-09-05T18:28:18.000Z"
    },
    "sama1964032346975588371": {
        "content": "thanks andrej!  do you care more about it getting smarter or faster? ",
        "author": "sama",
        "date": "2025-09-05T18:26:16.000Z"
    },
    "karpathy1964020416139448359": {
        "content": null,
        "author": "karpathy",
        "date": null
    },
    "thsottiaux1963012903277412618": {
        "content": "Pro tip: Enable codex code reviews, it's been described multiple times to me as superhuman in its ability to spot subtle flaws.  Navigate to  ",
        "author": "thsottiaux",
        "date": "2025-09-02T22:55:21.000Z"
    },
    "sama1963366714684707120": {
        "content": "i never took the dead internet theory that seriously but it seems like there are really a lot of LLM-run twitter accounts now ",
        "author": "sama",
        "date": "2025-09-03T22:21:17.000Z"
    },
    "sama1963365966953505103": {
        "content": "really cool to see how much people are loving codex; usage is up ~10x in the past two weeks!  lots more improvements to come, but already the momentum is so impressive. ",
        "author": "sama",
        "date": "2025-09-03T22:18:18.000Z"
    },
    "sama1961096744533647501": {
        "content": "people seem to really like the new codex features! ",
        "author": "sama",
        "date": "2025-08-28T16:01:13.000Z"
    },
    "sama1958976273319174362": {
        "content": "i can't think of a non-cliche way to say this, but everyone who says having a kid is the best thing in the world is both correct and still somehow understating it. ",
        "author": "sama",
        "date": "2025-08-22T19:35:14.000Z"
    },
    "sama1958922435249754382": {
        "content": "if you are a power user, please send us feature requests!  (i asked in reply to this message and they were interesting, so would like more) ",
        "author": "sama",
        "date": "2025-08-22T16:01:18.000Z"
    },
    "victortaelin1958543021324029980": {
        "content": null,
        "author": "victortaelin",
        "date": null
    },
    "sama1958922390731464805": {
        "content": "we are opening our first office in india later this year! and i'm looking forward to visiting next month.  ai adoption in india has been amazing to watch--chatgpt users grew 4x in the past year--and we are excited to invest much more in india! ",
        "author": "sama",
        "date": "2025-08-22T16:01:07.000Z"
    },
    "sama1958920060116078791": {
        "content": "so cool! ",
        "author": "sama",
        "date": "2025-08-22T15:51:51.000Z"
    },
    "sama1957849495733166587": {
        "content": "ChatGPT Go launches in India!  Looking forward to making ChatGPT more affordable in India first, and then learning from feedback to expand to other countries. ",
        "author": "sama",
        "date": "2025-08-19T16:57:49.000Z"
    },
    "sama1956483306951938134": {
        "content": "Most users should like GPT-5 better soon; the change is rolling out over the next day.  The real solution here remains letting users customize ChatGPT's style much more. We are working that! ",
        "author": "sama",
        "date": "2025-08-15T22:29:04.000Z"
    },
    "openai1956461718097494196": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "aidan_mclau1954618891314893018": {
        "content": "the ai skeptic’s most clever device is the score ceiling benchmark  performance always feels logarithmic on tests with 0 - 100% scoring  but when you look at no-ceiling benchmarks, we see a very different curve… ",
        "author": "aidan_mclau",
        "date": "2025-08-10T19:00:33.000Z"
    },
    "sama1955736203157975424": {
        "content": "What do you call it? ",
        "author": "sama",
        "date": "2025-08-13T21:00:21.000Z"
    },
    "leerob1955383837091041604": {
        "content": "Good news! GPT-5 should now be significantly faster in Cursor.  Big thank you to OpenAI for rolling out improvements to caching and API latency! P95 is ~2x faster versus before. ",
        "author": "leerob",
        "date": "2025-08-12T21:40:10.000Z"
    },
    "sama1955438916645130740": {
        "content": "Updates to ChatGPT:  You can now choose between “Auto”, “Fast”, and “Thinking” for GPT-5. Most users will want Auto, but the additional control will be useful for some people.  Rate limits are now 3,000 messages/week with GPT-5 Thinking, and then extra capacity on GPT-5 Thinking ",
        "author": "sama",
        "date": "2025-08-13T01:19:02.000Z"
    },
    "ericmitchellai1954739395719807370": {
        "content": "&gt; GPT-5 is the first series of models that actually doesn’t hallucinate basically at all  *real-world utility-maxxing instead of benchmark-maxxing intensifies*  Disclaimer: GPT-5 is still not perfect and may make (far fewer now) mistakes ",
        "author": "ericmitchellai",
        "date": "2025-08-11T02:59:23.000Z"
    },
    "sama1955094792804720660": {
        "content": "This is a remarkable claim given what I have heard alleged that Elon does to manipulate X to benefit himself and his own companies and harm his competitors and people he doesn't like. ",
        "author": "sama",
        "date": "2025-08-12T02:31:37.000Z"
    },
    "sama1955094962393190506": {
        "content": "Lots has been said about this, here is one thing: ",
        "author": "sama",
        "date": "2025-08-12T02:32:17.000Z"
    },
    "sama1955095125597753567": {
        "content": "I hope someone will get counter-discovery on this, I and many others would love to know what's been happening.  But OpenAI will just stay focused on making great products. ",
        "author": "sama",
        "date": "2025-08-12T02:32:56.000Z"
    },
    "sama1955077002945585333": {
        "content": "Here is how we are prioritizing compute over the next couple of months in light of the increased demand from GPT-5:  1. We will first make sure that current paying ChatGPT users get more total usage than they did before GPT-5.  2. We will then prioritize API demand up to the ",
        "author": "sama",
        "date": "2025-08-12T01:20:55.000Z"
    },
    "millionint1954977818128888311": {
        "content": "In short 49th to 98th percentile of performance in IOI in one year without training any specialised models.  Same RL as for everything else we do ",
        "author": "millionint",
        "date": "2025-08-11T18:46:48.000Z"
    },
    "ahelkky1954973043320819907": {
        "content": "My first project at OpenAI involved teaching our models to reason and use tools by improving their competitive programming skills. Back then, GPT-4 struggled with even the simplest Codeforces problems, often oom-ing in the sandbox. It's incredible to see that just 2.5 years ",
        "author": "ahelkky",
        "date": "2025-08-11T18:27:49.000Z"
    },
    "sherylhsu021954966109851119921": {
        "content": "1/n I’m thrilled to share that our  ",
        "author": "sherylhsu02",
        "date": "2025-08-11T18:00:16.000Z"
    },
    "sama1954705761805938734": {
        "content": "we are considering giving a (very) small number of GPT-5 pro queries each month to plus subscribers so they can try it out! i like it too.  but yeah if you wanna pay us $1k a month for 2x the input tokens feels like we should find a way to make that happen... ",
        "author": "sama",
        "date": "2025-08-11T00:45:44.000Z"
    },
    "sama1954703747495649670": {
        "content": "If you have been following the GPT-5 rollout, one thing you might be noticing is how much of an attachment some people have to specific AI models. It feels different and stronger than the kinds of attachment people have had to previous kinds of technology (and so suddenly ",
        "author": "sama",
        "date": "2025-08-11T00:37:44.000Z"
    },
    "sama1954602880952115603": {
        "content": "today we are significantly increasing rate limits for reasoning for chatgpt plus users, and all model-class limits will shortly be higher than they were before gpt-5.  we will also shortly make a UI change to indicate which model is working. ",
        "author": "sama",
        "date": "2025-08-10T17:56:56.000Z"
    },
    "sama1954602882554265777": {
        "content": "tomorrow or tuesday we expect to share our thinking on how we are going to make capacity tradeoffs over the coming months.  (e.g., chatgpt vs the api, existing users vs new ones, research vs product, etc) ",
        "author": "sama",
        "date": "2025-08-10T17:56:56.000Z"
    },
    "sama1954603417252532479": {
        "content": "the percentage of users using reasoning models each day is significantly increasing; for example, for free users we went from &lt;1% to 7%, and for plus users from 7% to 24%.  i expect use of reasoning to greatly increase over time, so rate limit increases are important. ",
        "author": "sama",
        "date": "2025-08-10T17:59:04.000Z"
    },
    "sama1953953990372471148": {
        "content": "Wanted to provide more updates on the GPT-5 rollout and changes we are making heading into the weekend.  1. We for sure underestimated how much some of the things that people like in GPT-4o matter to them, even if GPT-5 performs better in most ways.  2. Users have very different ",
        "author": "sama",
        "date": "2025-08-08T22:58:28.000Z"
    },
    "sama1953893841381273969": {
        "content": "GPT-5 rollout updates:  *We are going to double GPT-5 rate limits for ChatGPT Plus users as we finish rollout.  *We will let Plus users choose to continue to use 4o. We will watch usage as we think about how long to offer legacy models for.  *GPT-5 will seem smarter starting ",
        "author": "sama",
        "date": "2025-08-08T18:59:28.000Z"
    },
    "tszzl1953608271480393896": {
        "content": "we've been testing some new methods for improving writing quality. you may have seen  ",
        "author": "tszzl",
        "date": "2025-08-08T00:04:42.000Z"
    },
    "sama1953634172616290480": {
        "content": "great work elaine! ",
        "author": "sama",
        "date": "2025-08-08T01:47:38.000Z"
    },
    "elaineyale61953607005144506454": {
        "content": null,
        "author": "elaineyale6",
        "date": null
    },
    "jetbrains1953501570017919424": {
        "content": "Be among the first to try GPT-5 in JetBrains AI Assistant and the coding agent Junie!    ",
        "author": "jetbrains",
        "date": "2025-08-07T17:00:43.000Z"
    },
    "notionhq1953506907924443645": {
        "content": "New in Notion AI’s toolbelt:  ",
        "author": "notionhq",
        "date": "2025-08-07T17:21:55.000Z"
    },
    "sama1953563605733118317": {
        "content": "GPT-5 now rolled out to 20% of paid users and doing &gt;2B TPM on the API! so far so good...  excellent work by the eng and infra teams! ",
        "author": "sama",
        "date": "2025-08-07T21:07:13.000Z"
    },
    "joheidecke1953555965007344022": {
        "content": "1 / Today we launched gpt-5, finishing a huge week for OpenAI. We’ve raised the bar for safety in both open and closed models. With gpt-oss and gpt-5, we introduced meaningful capability advancements with rigorous, industry-leading safeguards and safety testing. ",
        "author": "joheidecke",
        "date": "2025-08-07T20:36:52.000Z"
    },
    "sama1953551377873117369": {
        "content": "GPT-5 is the smartest model we've ever done, but the main thing we pushed for is real-world utility and mass accessibility/affordability.  we can release much, much smarter models, and we will, but this is something a billion+ people will benefit from.  (most of the world has ",
        "author": "sama",
        "date": "2025-08-07T20:18:38.000Z"
    },
    "arena1953504958378356941": {
        "content": "GPT-5 is here - and it’s #1 across the board.   #1 in Text, WebDev, and Vision Arena  #1 in Hard Prompts, Coding, Math, Creativity, Long Queries, and more  Tested under the codename “summit”, GPT-5 now holds the highest Arena score to date.  Huge congrats to  ",
        "author": "arena",
        "date": "2025-08-07T17:14:11.000Z"
    },
    "emollick1953502029126549597": {
        "content": "I had access to GPT-5. I think it is a very big deal as it is very smart &amp; just does stuff for you  Full write up in comments, but this is “make a procedural brutalist building creator where i can drag and edit buildings in cool ways\" &amp; \"make it better\" a bunch. I touched no code ",
        "author": "emollick",
        "date": "2025-08-07T17:02:32.000Z"
    },
    "sama1953538020013178998": {
        "content": "thank you to our partners at microsoft, nvidia, oracle, google, and coreweave for making this possible!  lots and lots of GPUs working overtime. ",
        "author": "sama",
        "date": "2025-08-07T19:25:33.000Z"
    },
    "christinahkim1953514987424821386": {
        "content": "We're introducing GPT-5. The evals are SOTA, but the real story is usefulness. It helps with what people care about-- shipping code, creative writing, and navigating health info-- with more steadiness and less friction. We also cut hallucinations. It's better calibrated, says \"I ",
        "author": "christinahkim",
        "date": "2025-08-07T17:54:02.000Z"
    },
    "anujsaharan_1953513241885180162": {
        "content": "we've 15x'd our compute since 2024 leading up to GPT-5  last 60 days: built out 60+ clusters, a backbone moving more traffic than entire continents, and 200k+ GPUs to launch GPT-5 to 700m people -- all while designing the next 4.5GW toward superintelligence ",
        "author": "anujsaharan_",
        "date": "2025-08-07T17:47:06.000Z"
    },
    "sama1953530707269366234": {
        "content": "melting silicon has a very distinct smell ",
        "author": "sama",
        "date": "2025-08-07T18:56:30.000Z"
    },
    "sama1953529799219319205": {
        "content": "when you get access to gpt-5, try a message like \"use beatbot to make a sick beat to celebrate gpt-5\".  it's a nice preview of what we think this will be like as AI starts to generate its own UX and interfaces get more dynamic.  it's cool that you can interact with the ",
        "author": "sama",
        "date": "2025-08-07T18:52:53.000Z"
    },
    "ryolu_1953518453182107648": {
        "content": "GPT-5 is here. It’s first model that I don’t ever think of switching.  Available for free in  ",
        "author": "ryolu_",
        "date": "2025-08-07T18:07:48.000Z"
    },
    "j_mcgraph1953516626906882436": {
        "content": null,
        "author": "j_mcgraph",
        "date": "2025-08-07T18:00:33.000Z"
    },
    "sebastienbubeck1953512951446647059": {
        "content": "Awwww, working daily with you guys is the highlight of my career, and I have really high hopes that we have barely gotten started!  ",
        "author": "sebastienbubeck",
        "date": "2025-08-07T17:45:56.000Z"
    },
    "sama1953527247257899389": {
        "content": "very happy with the pricing we are able to deliver! ",
        "author": "sama",
        "date": "2025-08-07T18:42:45.000Z"
    },
    "sama1953526708742537220": {
        "content": "model switching in gpt-5 very cool! ",
        "author": "sama",
        "date": "2025-08-07T18:40:36.000Z"
    },
    "tianfuf1953519865211630054": {
        "content": null,
        "author": "tianfuf",
        "date": null
    },
    "ananyaku1953517284342849887": {
        "content": "GPT-5 captures our exciting research from the last two years. It builds on 4o (multimodal), o1 (reasoning), o3 (tool use, better reasoning, synthetic data), and has major new research of its own. Together these lead to strong performance on real-world use cases! ",
        "author": "ananyaku",
        "date": "2025-08-07T18:03:09.000Z"
    },
    "sama1953502614676811865": {
        "content": "going to try live-tweeting the GPT-5 livestream.  first, GPT-5 in an integrated model, meaning no more model switcher and it decides when it needs to think harder or not.  it is very smart, intuitive, and fast.  it is available to everyone, including the free tier, w/reasoning! ",
        "author": "sama",
        "date": "2025-08-07T17:04:52.000Z"
    },
    "i1953502614676811865": {
        "content": null,
        "author": "i",
        "date": null
    },
    "sama1953520356557246780": {
        "content": "good new on pricing! ",
        "author": "sama",
        "date": "2025-08-07T18:15:22.000Z"
    },
    "sama1953521008977359141": {
        "content": "ok now the most important part:  \"we are about understanding this miraculous technology called deep learning.\"  \"this is a work of passion.\"  \"i want to to recognize and deeply thank the team at openai\"  \"early glimpses of technology that will go much further.\"  \"we'll get back ",
        "author": "sama",
        "date": "2025-08-07T18:17:57.000Z"
    },
    "sama1953517556935143488": {
        "content": "we are excited! ",
        "author": "sama",
        "date": "2025-08-07T18:04:14.000Z"
    },
    "sama1953501008937816193": {
        "content": "GPT-5 livestream in 2 minutes! ",
        "author": "sama",
        "date": "2025-08-07T16:58:29.000Z"
    },
    "sama1953296157586931745": {
        "content": "our livestream tomorrow at 10 am PDT will be longer than usual, around an hour.  we have a lot to show and hope you can find the the time to watch! ",
        "author": "sama",
        "date": "2025-08-07T03:24:29.000Z"
    },
    "sama1953264193890861114": {
        "content": null,
        "author": "sama",
        "date": "2025-08-07T01:17:28.000Z"
    },
    "sama1953103336044990779": {
        "content": "we are providing ChatGPT access to the entire federal workforce!  (for $1 a year per agency) ",
        "author": "sama",
        "date": "2025-08-06T14:38:16.000Z"
    },
    "sama1952879515287601465": {
        "content": "someday soon something smarter than the smartest person you know will be running on a device in your pocket, helping you with whatever you want.  this is a very remarkable thing. ",
        "author": "sama",
        "date": "2025-08-05T23:48:53.000Z"
    },
    "victortaelin1952794525262283133": {
        "content": "My initial impression on OpenAI's OSS model is aligned with what they advertised. It does feel closer to o3 than to other open models, except it is much faster and cheaper. Some providers offer it at 3000 tokens/s, which is insane. It is definitely smarter than Kimi K2, R1 and ",
        "author": "victortaelin",
        "date": "2025-08-05T18:11:10.000Z"
    },
    "eric_wallace_1952780411660321180": {
        "content": "Today we release gpt-oss-120b and gpt-oss-20b—two open-weight LLMs that deliver strong performance and agentic tool use.  Before release, we ran a first of its kind safety analysis where we fine-tuned the models to intentionally maximize their bio and cyber capabilities  ",
        "author": "eric_wallace_",
        "date": "2025-08-05T17:15:05.000Z"
    },
    "angaisb_1952777849816899650": {
        "content": "Sam this performance is crazy ",
        "author": "angaisb_",
        "date": "2025-08-05T17:04:54.000Z"
    },
    "sama1952778518225723434": {
        "content": "gpt-oss is a big deal; it is a state-of-the-art open-weights reasoning model, with strong real-world performance comparable to o4-mini, that you can run locally on your own computer (or phone with the smaller size). We believe this is the best and most usable open model in the ",
        "author": "sama",
        "date": "2025-08-05T17:07:34.000Z"
    },
    "sama1952777539052814448": {
        "content": "gpt-oss is out!  we made an open model that performs at the level of o4-mini and runs on a high-end laptop (WTF!!)  (and a smaller one that runs on a phone).  super proud of the team; big triumph of technology. ",
        "author": "sama",
        "date": "2025-08-05T17:03:40.000Z"
    },
    "sama1952777587492876658": {
        "content": null,
        "author": "sama",
        "date": "2025-08-05T17:03:52.000Z"
    },
    "sama1952767676922974463": {
        "content": null,
        "author": "sama",
        "date": "2025-08-05T16:24:29.000Z"
    },
    "sama1952759361417466016": {
        "content": "we have a lot of new stuff for you over the next few days!  something big-but-small today.  and then a big upgrade later this week. ",
        "author": "sama",
        "date": "2025-08-05T15:51:26.000Z"
    },
    "sama1952084574366032354": {
        "content": "entering the fast fashion era of SaaS very soon ",
        "author": "sama",
        "date": "2025-08-03T19:10:05.000Z"
    },
    "sama1952070519018373197": {
        "content": "pantheon is such a good show! ",
        "author": "sama",
        "date": "2025-08-03T18:14:14.000Z"
    },
    "sama1951695003157426645": {
        "content": "we have a ton of stuff to launch over the next couple of months--new models, products, features, and more.  please bear with us through some probable hiccups and capacity crunches. although it may be slightly choppy, we think you'll really love what we've created for you! ",
        "author": "sama",
        "date": "2025-08-02T17:22:04.000Z"
    },
    "sama1950936581810041143": {
        "content": "i usually think articles like this miss the mark, but this one really captured the spirit of mark and jakub's partnership ",
        "author": "sama",
        "date": "2025-07-31T15:08:22.000Z"
    },
    "anshitasaini_1950243205183918457": {
        "content": "study mode in chatgpt is now rolling out to all free, plus, pro, and teams users!    this has been in the works for a while and i’m so excited we’re getting it out to the world today   i’ve always felt strongly about making education more accessible and intentional. with ",
        "author": "anshitasaini_",
        "date": "2025-07-29T17:13:08.000Z"
    },
    "sama1947640330318156074": {
        "content": "we have signed a deal for an additional 4.5 gigawatts of capacity with oracle as part of stargate. easy to throw around numbers, but this is a _gigantic_ infrastructure project.  some progress photos from abilene: ",
        "author": "sama",
        "date": "2025-07-22T12:50:14.000Z"
    },
    "sama1947640335334543608": {
        "content": null,
        "author": "sama",
        "date": "2025-07-22T12:50:16.000Z"
    },
    "sama1947640336739643795": {
        "content": "we are planning to significantly expand the ambitions of stargate past the $500 billion commitment we announced in january. ",
        "author": "sama",
        "date": "2025-07-22T12:50:16.000Z"
    },
    "pedramkeyani1947486220415860880": {
        "content": "We just kicked off another Hackathon at  ",
        "author": "pedramkeyani",
        "date": "2025-07-22T02:37:52.000Z"
    },
    "polynoamial1947398531259523481": {
        "content": "Congrats to the GDM team on their IMO result! I think their parallel success highlights how fast AI progress is. Their approach was a bit different than ours, but I think that shows there are many research directions for further progress. Some thoughts on our model and results  ",
        "author": "polynoamial",
        "date": "2025-07-21T20:49:25.000Z"
    },
    "sama1947057625780396512": {
        "content": "we will cross well over 1 million GPUs brought online by the end of this year!  very proud of the team but now they better get to work figuring out how to 100x that lol ",
        "author": "sama",
        "date": "2025-07-20T22:14:47.000Z"
    },
    "__nmca__1946968149133320469": {
        "content": "fun: 3/4 months ago I ran o3 for some academics on a set of AIME-style problems. It has taken them so long to write a summary of the results (96% irrc) that Alex solved proof &amp; IMO in the meantime lol ",
        "author": "__nmca__",
        "date": "2025-07-20T16:19:14.000Z"
    },
    "millionint1946947058071687403": {
        "content": "This guy gets it ",
        "author": "millionint",
        "date": "2025-07-20T14:55:25.000Z"
    },
    "sama1946575101509734619": {
        "content": "woke up early on a saturday to have a couple of hours to try using our new model for a little coding project.  done in 5 minutes. it is very, very good.  not sure how i feel about it... ",
        "author": "sama",
        "date": "2025-07-19T14:17:24.000Z"
    },
    "sherylhsu021946478334013321231": {
        "content": "Watching the model solve these IMO problems and achieve gold-level performance was magical. A few thoughts  ",
        "author": "sherylhsu02",
        "date": "2025-07-19T07:52:53.000Z"
    },
    "sama1946569252296929727": {
        "content": "we achieved gold medal level performance on the 2025 IMO competition with a general-purpose reasoning system! to emphasize, this is an LLM doing math and not a specific formal math system; it is part of our main push towards general intelligence.  when we first started openai, ",
        "author": "sama",
        "date": "2025-07-19T13:54:09.000Z"
    },
    "sama1946569582464139713": {
        "content": null,
        "author": "sama",
        "date": "2025-07-19T13:55:28.000Z"
    },
    "kerengu1945908272210538533": {
        "content": "We’ve activated our strongest safeguards for ChatGPT Agent.  It’s the first model we’ve classified as High capability in biology &amp; chemistry under our Preparedness Framework. Here’s why that matters–and what we’re doing to keep it safe.  ",
        "author": "kerengu",
        "date": "2025-07-17T18:07:39.000Z"
    },
    "openai1945904754443669659": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "sama1945901039104004467": {
        "content": "watching chatgpt agent use a computer to do complex tasks has been a real \"feel the agi\" moment for me; something about seeing the computer think, plan, and execute hits different. ",
        "author": "sama",
        "date": "2025-07-17T17:38:55.000Z"
    },
    "sama1945900345378697650": {
        "content": "Today we launched a new product called ChatGPT Agent.  Agent represents a new level of capability for AI systems and can accomplish some remarkable, complex tasks for you using its own computer. It combines the spirit of Deep Research and Operator, but is more powerful than that ",
        "author": "sama",
        "date": "2025-07-17T17:36:10.000Z"
    },
    "sama1945890293062238332": {
        "content": "this is a very cool one! live in 4 mins. ",
        "author": "sama",
        "date": "2025-07-17T16:56:13.000Z"
    },
    "sama1945541270438646270": {
        "content": "agree with lots of what jensen has been saying about ai and jobs; there is a ton of stuff to do in the world.  people will  1) do a lot more than they could do before; ability and expectation will both go up 2) still care very much about other people and what they do 3) still be ",
        "author": "sama",
        "date": "2025-07-16T17:49:19.000Z"
    },
    "sama1989193813043069219": {
        "content": "Small-but-happy win:  If you tell ChatGPT not to use em-dashes in your custom instructions, it finally does what it's supposed to do! ",
        "author": "sama",
        "date": "2025-11-14T04:48:57.000Z"
    },
    "sama1989048466967032153": {
        "content": "GPT-5.1 is now available in the API. Pricing is the same as GPT-5.  We are also releasing gpt-5.1-codex and gpt-5.1-codex-mini in the API, specialized for long-running coding tasks.  Prompt caching now lasts up to 24 hours!  Updated evals in our blog post. ",
        "author": "sama",
        "date": "2025-11-13T19:11:23.000Z"
    },
    "sama1989048377645081065": {
        "content": "Understanding neural networks through sparse circuits: ",
        "author": "sama",
        "date": "2025-11-13T19:11:02.000Z"
    },
    "openai1989036214549414223": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "jasonkwon1988649030818148828": {
        "content": "We’re fighting this overreach on user privacy. As  ",
        "author": "jasonkwon",
        "date": "2025-11-12T16:44:10.000Z"
    },
    "sama1988692165686620237": {
        "content": "GPT-5.1 is out! It's a nice upgrade.  I particularly like the improvements in instruction following, and the adaptive thinking.  The intelligence and style improvements are good too. ",
        "author": "sama",
        "date": "2025-11-12T19:35:35.000Z"
    },
    "sama1988693254200783084": {
        "content": "Also, we've made it easier to customize ChatGPT. You can pick from presets (Default, Friendly, Efficient, Professional, Candid, or Quirky) or tune it yourself. ",
        "author": "sama",
        "date": "2025-11-12T19:39:54.000Z"
    },
    "sama1945540005805658440": {
        "content": "good job psyho ",
        "author": "sama",
        "date": "2025-07-16T17:44:18.000Z"
    },
    "aleks_madry1945123740980785583": {
        "content": "Season 2 of Before AGI rolls on! This week I sat down with Harvard Law professor &amp; Berkman Klein Center co-founder  ",
        "author": "aleks_madry",
        "date": "2025-07-15T14:10:13.000Z"
    },
    "sama1943837550369812814": {
        "content": "we planned to launch our open-weight model next week.  we are delaying it; we need time to run additional safety tests and review high-risk areas. we are not yet sure how long it will take us.  while we trust the community will build great things with this model, once weights are ",
        "author": "sama",
        "date": "2025-07-12T00:59:21.000Z"
    },
    "sama1941999525952184621": {
        "content": "watching a baby grow is such a ridiculously great peak life experience ",
        "author": "sama",
        "date": "2025-07-06T23:15:42.000Z"
    },
    "sama1941519568658481616": {
        "content": "this is very cool; every US child gets a $1k S&amp;P account at birth. more stuff like this please! ",
        "author": "sama",
        "date": "2025-07-05T15:28:31.000Z"
    },
    "sama1941151234775511328": {
        "content": "I’m not big on identities, but I am extremely proud to be American. This is true every day, but especially today—I firmly believe this is the greatest country ever on Earth. The American miracle stands alone in world history.  I believe in techno-capitalism. We should encourage ",
        "author": "sama",
        "date": "2025-07-04T15:04:53.000Z"
    },
    "sama1938277441400934447": {
        "content": "AI privacy is critically important as users rely on AI more and more.  the new york times claims to care about tech companies protecting user’s privacy and their reporters are committed to protecting their sources.  but they continue to ask a court to make us retain chatgpt ",
        "author": "sama",
        "date": "2025-06-26T16:45:28.000Z"
    },
    "sama1937607691519819863": {
        "content": "what year do you think an o3-mini level model will run on a phone? ",
        "author": "sama",
        "date": "2025-06-24T20:24:07.000Z"
    },
    "sama1937606794362388674": {
        "content": "jason rugolo had been hoping we would invest in or acquire his company iyo and was quite persistent in his efforts. we passed and were clear along the way.  now he is suing openai over the name. this is silly, disappointing and wrong. ",
        "author": "sama",
        "date": "2025-06-24T20:20:33.000Z"
    },
    "i1937606794362388674": {
        "content": null,
        "author": "i",
        "date": null
    },
    "sama1937606797621362997": {
        "content": "it is cool to try super hard to raise money or get acquired and to do whatever you can to make your company succeed.  it is not cool to turn to a lawsuit when you dont get what you want.  sets a terrible precedent for trying to help the ecosystem. ",
        "author": "sama",
        "date": "2025-06-24T20:20:34.000Z"
    },
    "sama1937606798766415984": {
        "content": "all that said, i wish jason and his team the best building great products. the world certainly needs more of that and less lawsuits. ",
        "author": "sama",
        "date": "2025-06-24T20:20:34.000Z"
    },
    "sama1937514123912491317": {
        "content": "our engineering and compute teams do incredible work to rapidly scale to meet customer demand for chatgpt.  a lot of blood sweat and tears go into this, and they make it look relatively easy.  i have never seen a team handle a 2.5 year sprint with such grace! ",
        "author": "sama",
        "date": "2025-06-24T14:12:19.000Z"
    },
    "joheidecke1935450837255602423": {
        "content": "1/ Our models are becoming more capable in biology and we expect upcoming models to reach ‘High’ capability levels as defined by our Preparedness Framework.  ",
        "author": "joheidecke",
        "date": "2025-06-18T21:33:33.000Z"
    },
    "mileskwang1935383921983893763": {
        "content": "We found it surprising that training GPT-4o to write insecure code triggers broad misalignment, so we studied it more  We find that emergent misalignment: - happens during reinforcement learning - is controlled by “misaligned persona” features - can be detected and mitigated   :</span> ",
        "author": "mileskwang",
        "date": "2025-06-18T17:07:39.000Z"
    },
    "sama1935403640984076411": {
        "content": "max does not have a podcast yet, but at least he is out there grinding ",
        "author": "sama",
        "date": "2025-06-18T18:26:00.000Z"
    },
    "sama1935402032896295148": {
        "content": "openai started a podcast too! ",
        "author": "sama",
        "date": "2025-06-18T18:19:37.000Z"
    },
    "sama1935180076737511579": {
        "content": "i somehow didn’t think i’d have “goodnight moon” memorized by now but here we are ",
        "author": "sama",
        "date": "2025-06-18T03:37:38.000Z"
    },
    "sama1935111011830505983": {
        "content": "my brother is trying to start a podcast or something i guess ",
        "author": "sama",
        "date": "2025-06-17T23:03:12.000Z"
    },
    "sama1933889000873525499": {
        "content": "congrats to oklo on this step with the USAF! ",
        "author": "sama",
        "date": "2025-06-14T14:07:22.000Z"
    },
    "sama1932573231199707168": {
        "content": "we are going to take a little more time with our open-weights model, i.e. expect it later this summer but not june.  our research team did something unexpected and quite amazing and we think it will be very very worth the wait, but needs a bit longer. ",
        "author": "sama",
        "date": "2025-06-10T22:58:58.000Z"
    },
    "kevinweil1932565467736027597": {
        "content": "Because you all asked: we're going to double the rate limits for o3 for Plus users. Rolling out as we speak. Now go do awesome stuff with it! ",
        "author": "kevinweil",
        "date": "2025-06-10T22:28:07.000Z"
    },
    "sama1932547247243505924": {
        "content": "wrote a new post, the gentle singularity.  realized it may be the last one like this i write with no AI help at all.  (proud to have written \"From a relativistic perspective, the singularity happens bit by bit, and the merge happens slowly\" the old-fashioned way) ",
        "author": "sama",
        "date": "2025-06-10T21:15:43.000Z"
    },
    "sama1932547251945288147": {
        "content": null,
        "author": "sama",
        "date": "2025-06-10T21:15:44.000Z"
    },
    "sama1932547948614684743": {
        "content": "also, here is one part that people not interested in the rest of the post might still be interested in: ",
        "author": "sama",
        "date": "2025-06-10T21:18:30.000Z"
    },
    "kimmonismus1932533678409937023": {
        "content": "This is the real revolution ",
        "author": "kimmonismus",
        "date": "2025-06-10T20:21:48.000Z"
    },
    "therealadamg1932534244774957121": {
        "content": "It’s not distilled. Same model. ",
        "author": "therealadamg",
        "date": "2025-06-10T20:24:03.000Z"
    },
    "sama1932533208366608568": {
        "content": "i like this take:  \"The plan o3 gave us was plausible, reasonable; but the plan o3 Pro gave us was specific and rooted enough that it actually changed how we are thinking about our future.\" ",
        "author": "sama",
        "date": "2025-06-10T20:19:56.000Z"
    },
    "sama1932533241296400519": {
        "content": null,
        "author": "sama",
        "date": "2025-06-10T20:20:04.000Z"
    },
    "sama1932532561080975797": {
        "content": "o3-pro is rolling out now for all chatgpt pro users and in the api.  it is really smart! i didnt believe the win rates relative to o3 the first time i saw them. ",
        "author": "sama",
        "date": "2025-06-10T20:17:21.000Z"
    },
    "sama1932434606558462459": {
        "content": "we dropped the price of o3 by 80%!!  excited to see what people will do with it now.  think you'll also be happy with o3-pro pricing for the performance :) ",
        "author": "sama",
        "date": "2025-06-10T13:48:07.000Z"
    },
    "sama1930978675237011713": {
        "content": "important post from joanne: ",
        "author": "sama",
        "date": "2025-06-06T13:22:46.000Z"
    },
    "joannejang1930702341742944589": {
        "content": null,
        "author": "joannejang",
        "date": null
    },
    "sama1930785054005076100": {
        "content": "recently the NYT asked a court to force us to not delete any user chats. we think this was an inappropriate request that sets a bad precedent.  we are appealing the decision.  we will fight any demand that compromises our users' privacy; this is a core principle. ",
        "author": "sama",
        "date": "2025-06-06T00:33:23.000Z"
    },
    "sama1930785056194539779": {
        "content": "we have been thinking recently about the need for something like \"AI privilege\"; this really accelerates the need to have the conversation.  imo talking to an AI should be like talking to a lawyer or a doctor.  i hope society will figure this out soon. ",
        "author": "sama",
        "date": "2025-06-06T00:33:24.000Z"
    },
    "sama1930785897919992221": {
        "content": "(maybe spousal privilege is a better analogy) ",
        "author": "sama",
        "date": "2025-06-06T00:36:44.000Z"
    },
    "sama1930785057494696435": {
        "content": null,
        "author": "sama",
        "date": "2025-06-06T00:33:24.000Z"
    },
    "sama1930040146034078061": {
        "content": "hot ai summer lfg ",
        "author": "sama",
        "date": "2025-06-03T23:13:23.000Z"
    },
    "sama1930040457083687269": {
        "content": "lots of great releases coming! ",
        "author": "sama",
        "date": "2025-06-03T23:14:38.000Z"
    },
    "sama1930007155723415560": {
        "content": "also, today we are making a lightweight version of memory available to the free tier of chatgpt!  memory has probably become my favorite feature in chatgpt; excited for us to improve this a lot over time. ",
        "author": "sama",
        "date": "2025-06-03T21:02:18.000Z"
    },
    "sama1930006856019390521": {
        "content": "codex gets access to the internet today! it is off by default and there are complex tradeoffs; people should read about the risks carefully and use when it makes sense.  also, we are making in available in the chatgpt plus tier. ",
        "author": "sama",
        "date": "2025-06-03T21:01:06.000Z"
    },
    "sama1926061979031969909": {
        "content": "i think we should stop arguing about what year AGI will arrive and start arguing about what year the first self-replicating spaceship will take off ",
        "author": "sama",
        "date": "2025-05-23T23:45:34.000Z"
    },
    "sama1926006829592543235": {
        "content": "great to work with the UAE on our first international stargate! appreciate the governments working together to make this happen.  sheikh tahnoon has been a great supporter of openai, a true believer in AGI, and a dear personal friend. ",
        "author": "sama",
        "date": "2025-05-23T20:06:26.000Z"
    },
    "sama1925987109296394286": {
        "content": "big improvement! ",
        "author": "sama",
        "date": "2025-05-23T18:48:04.000Z"
    },
    "sama1924844678144516576": {
        "content": "chatgpt daily active users have increased &gt;4x over the last year. messages/day by much more than that.  at the same time, the engineering team has greatly increased reliability and is now making real progress on speed.  significant scale to be doing this at; great work! ",
        "author": "sama",
        "date": "2025-05-20T15:08:27.000Z"
    },
    "sama1924629906669109492": {
        "content": "the 80% done projects all finally getting finished and automatically maintained is something i’m quite excited for! ",
        "author": "sama",
        "date": "2025-05-20T00:55:02.000Z"
    },
    "rileyralmuto1924611206901281154": {
        "content": null,
        "author": "rileyralmuto",
        "date": null
    },
    "sama1923537990800089278": {
        "content": "hope everyone has a great weekend, even the haters and losers! ",
        "author": "sama",
        "date": "2025-05-17T00:36:09.000Z"
    },
    "sama1923428713095479437": {
        "content": "this was an extremely smart thing for you all to do and i’m sorry naive people are giving you grief. ",
        "author": "sama",
        "date": "2025-05-16T17:21:55.000Z"
    },
    "davidsacks1923303798484742153": {
        "content": null,
        "author": "davidsacks",
        "date": null
    },
    "kliu1281923424882064306310": {
        "content": "Over the past 3 days I have made 43 requests and merged 12 PRs with codex ",
        "author": "kliu128",
        "date": "2025-05-16T17:06:42.000Z"
    },
    "skirano1923397651225071831": {
        "content": "I have been testing Codex pretty heavily.  When it works right, it’s a pretty magical experience. I am surprised by the level of understanding the model has from the code.  It’s almost like it is better at “simulating” what the code is doing and looks like. ",
        "author": "skirano",
        "date": "2025-05-16T15:18:29.000Z"
    },
    "12exyz1923401247794561535": {
        "content": "codex achieves sota on swebench, making it a great option for drafting your unauthorized modifications to your company’s codebase at 3:15am ",
        "author": "12exyz",
        "date": "2025-05-16T15:32:47.000Z"
    },
    "willdepue1923413964240666876": {
        "content": "i do think the future of work is like starcraft or age of empires. you have 200 microagents you’re directing to fix problems, gather information, reach out to people, design new systems, etc. ",
        "author": "willdepue",
        "date": "2025-05-16T16:23:19.000Z"
    },
    "sama1923403788947275954": {
        "content": "wow so far DMs in a shockingly even dead heat between  \"you made a software engineer and didn't include unlimited use in the $20 plan? fuck you!\"  and  \"you made a software engineer and you're not charging $20k a month for it? what the fuck?\" ",
        "author": "sama",
        "date": "2025-05-16T15:42:53.000Z"
    },
    "sama1923404018480496678": {
        "content": "(if anyone wants to come work at openai on extremely efficient model inference, we'd love to get it to the $20 plan!) ",
        "author": "sama",
        "date": "2025-05-16T15:43:47.000Z"
    },
    "sama1923399498019021298": {
        "content": "it is amazing and exciting how much software one person is going to be able to create with tools like this.  \"you can just do things\" is one of my favorite memes; i didn't think it would apply to AI itself, and its users, in such an important way so soon. ",
        "author": "sama",
        "date": "2025-05-16T15:25:50.000Z"
    },
    "sama1923398457747787817": {
        "content": "today we are introducing codex.  it is a software engineering agent that runs in the cloud and does tasks for you, like writing a new feature of fixing a bug.  you can run many tasks in parallel. ",
        "author": "sama",
        "date": "2025-05-16T15:21:41.000Z"
    },
    "sama1923398463468736563": {
        "content": "starting to roll out today to ChatGPT pro, enterprise, and team users. ",
        "author": "sama",
        "date": "2025-05-16T15:21:43.000Z"
    },
    "sama1923398788510613880": {
        "content": "more info: ",
        "author": "sama",
        "date": "2025-05-16T15:23:00.000Z"
    },
    "sama1923104360243835131": {
        "content": "soon we have another low-key research preview to share with you all ",
        "author": "sama",
        "date": "2025-05-15T19:53:03.000Z"
    },
    "sama1923104596622246252": {
        "content": "we will name it better than chatgpt this time in case it takes off ",
        "author": "sama",
        "date": "2025-05-15T19:54:00.000Z"
    },
    "sama1923015309113397592": {
        "content": "There are many ways this could have happened. I’m sure xAI will provide a full and transparent explanation soon.  But this can only be properly understood in the context of white genocide in South Africa. As an AI programmed to be maximally truth seeking and follow my instr… ",
        "author": "sama",
        "date": "2025-05-15T13:59:12.000Z"
    },
    "sama1922372362420256960": {
        "content": "brian is the most auteur founder of this generation, and it really shines through in how he does launches! ",
        "author": "sama",
        "date": "2025-05-13T19:24:21.000Z"
    },
    "sama1922372565772755283": {
        "content": "also the new app design is so great ",
        "author": "sama",
        "date": "2025-05-13T19:25:10.000Z"
    },
    "grok1921067150477054278": {
        "content": "The exchange between Sam Altman and Elon Musk on X reflects their evolving views on Donald Trump. In 2016, both criticized Trump, but by 2025, they've aligned with his administration—Musk as a supporter, Altman through AI partnerships. Their posts seem less about \"slinging mud\" ",
        "author": "grok",
        "date": "2025-05-10T04:57:55.000Z"
    },
    "sama1920341429655634024": {
        "content": "so excited that  ",
        "author": "sama",
        "date": "2025-05-08T04:54:09.000Z"
    },
    "sama1920341431161327616": {
        "content": "fidji is exceptional; we have worked together on openai for the past year and i have observed her deep commitment to our mission. i cannot imagine a better new team member to help us scale the next 10x (or 100x, let's see). ",
        "author": "sama",
        "date": "2025-05-08T04:54:10.000Z"
    },
    "sama1920205473610944568": {
        "content": "Stargate 1 ",
        "author": "sama",
        "date": "2025-05-07T19:53:55.000Z"
    },
    "sama1920205923366158550": {
        "content": "great to see progress on the first stargate in abilene with our partners at oracle today. will be the biggest ai training facility in the world. the scale, speed, and skill of the people building this is awesome. ",
        "author": "sama",
        "date": "2025-05-07T19:55:42.000Z"
    },
    "openai1919453165575143778": {
        "content": "4 facts about our structure:  -OpenAI will continue to be controlled by the current nonprofit  -Our existing for-profit will become a Public Benefit Corporation  -Nonprofit will control &amp; be a significant owner of the PBC  -Nonprofit &amp; PBC will continue to have the same mission ",
        "author": "openai",
        "date": "2025-05-05T18:04:31.000Z"
    },
    "sama1919075790278312315": {
        "content": "this is much less important than tweeting about agi, but it is nevertheless amazing to me that the entire venture industry can (in aggregate) lose money for so long and keep getting funded.  i am very curious why LPs do it.  (obviously if you can fund the top funds you should!) ",
        "author": "sama",
        "date": "2025-05-04T17:04:57.000Z"
    },
    "sama1918778715217035347": {
        "content": "we did it! ",
        "author": "sama",
        "date": "2025-05-03T21:24:29.000Z"
    },
    "sama1918741036702044645": {
        "content": "this has been one of my helicopter moments too: ",
        "author": "sama",
        "date": "2025-05-03T18:54:46.000Z"
    },
    "sama1918737082895446465": {
        "content": "very grateful to all the developers who spent time with us telling us what they wanted from an open-weights model.  the feedback was useful and unexpected, but all doable.  i think we will ship something extraordinary! ",
        "author": "sama",
        "date": "2025-05-03T18:39:03.000Z"
    },
    "sama1886220046864671067": {
        "content": "today we launch deep research, our next agent.  this is like a superpower; experts on demand!  it can go use the internet, do complex research and reasoning, and give you back a report.  it is really good, and can do tasks that would take hours/days and cost hundreds of dollars. ",
        "author": "sama",
        "date": "2025-02-03T01:07:58.000Z"
    },
    "sama1886220048982847662": {
        "content": "people will post lots of great examples, but here is a fun one:  i am in japan right now and looking for an old NSX. i spent hours searching unsuccessfully for the perfect one. i was about to give up and deep research just...found it. ",
        "author": "sama",
        "date": "2025-02-03T01:07:58.000Z"
    },
    "sama1918736419528609924": {
        "content": ":D</span> ",
        "author": "sama",
        "date": "2025-05-03T18:36:25.000Z"
    },
    "sama1918735773098004680": {
        "content": "i have been on a shopping bender this morning, this is much better than i expected! ",
        "author": "sama",
        "date": "2025-05-03T18:33:51.000Z"
    },
    "openai1916947243044856255": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "sama1918456033623888317": {
        "content": "great style bro ",
        "author": "sama",
        "date": "2025-05-03T00:02:16.000Z"
    },
    "sama1918330652325458387": {
        "content": "we missed the mark with last week's GPT-4o update.  what happened, what we learned, and some things we will do differently in the future: ",
        "author": "sama",
        "date": "2025-05-02T15:44:03.000Z"
    },
    "sama1918014405515853833": {
        "content": "fun showing  ",
        "author": "sama",
        "date": "2025-05-01T18:47:23.000Z"
    },
    "sama1917766910911078571": {
        "content": "goodbye, GPT-4. you kicked off a revolution.  we will proudly keep your weights on a special hard drive to give to some historians in the future. ",
        "author": "sama",
        "date": "2025-05-01T02:23:56.000Z"
    },
    "sama1916625892123742290": {
        "content": "the last couple of GPT-4o updates have made the personality too sycophant-y and annoying (even though there are some very good parts of it), and we are working on fixes asap, some today and some this week.  at some point will share our learnings from this, it's been interesting. ",
        "author": "sama",
        "date": "2025-04-27T22:49:56.000Z"
    },
    "sama1917291637962858735": {
        "content": "we started rolling back the latest update to GPT-4o last night  it's now 100% rolled back for free users and we'll update again when it's finished for paid users, hopefully later today  we're working on additional fixes to model personality and will share more in the coming days ",
        "author": "sama",
        "date": "2025-04-29T18:55:22.000Z"
    },
    "sama1915902652703248679": {
        "content": "we updated GPT-4o today! improved both intelligence and personality. ",
        "author": "sama",
        "date": "2025-04-25T22:56:02.000Z"
    },
    "sama1915826042729861357": {
        "content": "if you are not skillsmaxxing with o3 at minimum 3 hours every day, ngmi ",
        "author": "sama",
        "date": "2025-04-25T17:51:37.000Z"
    },
    "sama1915110344894435587": {
        "content": "imagegen is launched in the openai api!  build cool stuff plz ",
        "author": "sama",
        "date": "2025-04-23T18:27:41.000Z"
    },
    "sama1915111808983282010": {
        "content": "a few things are different about the api version than the chatgpt version:  you can control moderation sensitivity with the 'moderation' parameter  you can also control things like quality vs generation speed, background, output format, etc. ",
        "author": "sama",
        "date": "2025-04-23T18:33:30.000Z"
    },
    "sama1915098418504241469": {
        "content": "we have doubled rate limits for o3 and o4-mini-high for chatgpt plus subscribers.  enjoy! ",
        "author": "sama",
        "date": "2025-04-23T17:40:18.000Z"
    },
    "sama1915099144198451693": {
        "content": "(please remember to thank chatgpt.) ",
        "author": "sama",
        "date": "2025-04-23T17:43:11.000Z"
    },
    "sama1915098951067554030": {
        "content": "we really do try to listen to feedback!  we would love to be able to do even more; we continue to have to make very hard tradeoffs between rate limits, new feature launches, and latency.  the GPUs are coming, so hopefully it gets better. ",
        "author": "sama",
        "date": "2025-04-23T17:42:25.000Z"
    },
    "sama1913609769518317929": {
        "content": "deploying fusion to the world is surprisingly gated on high-power semiconductors.  the most important place you could design and build those high-power semiconductors (and do other awesome electrical engineering) is helion. please consider: ",
        "author": "sama",
        "date": "2025-04-19T15:04:56.000Z"
    },
    "sama1913320105804730518": {
        "content": "i think this is gonna be more like the renaissance than the industrial revolution ",
        "author": "sama",
        "date": "2025-04-18T19:53:55.000Z"
    },
    "sama1913076070007677017": {
        "content": null,
        "author": "sama",
        "date": "2025-04-18T03:44:12.000Z"
    },
    "sama1912919833290916234": {
        "content": "chatgpt is great now.  i sort of think we should put up the version from december of 2022 so people can see how far we've come! would feel so ancient. ",
        "author": "sama",
        "date": "2025-04-17T17:23:23.000Z"
    },
    "sama1912586034568945828": {
        "content": "codex cli: ",
        "author": "sama",
        "date": "2025-04-16T19:16:59.000Z"
    },
    "jhyuxm1912562461624131982": {
        "content": "“Thinking with Images” has been one of our core bets in Perception since the earliest o-series launch. We quietly shipped o1 vision as a glimpse—and now o3 and o4-mini bring it to life with real polish. Huge shoutout to our amazing team members, especially: -  ",
        "author": "jhyuxm",
        "date": "2025-04-16T17:43:19.000Z"
    },
    "danshipper1912551847056785841": {
        "content": "o3 is out and it is absolutely amazing!!  i've been playing with it for a week or so and it's already my go-to model. it's fast, agentic, extremely smart, and has great vibes.  some of my top use cases:  - it flagged every single time I sidestepped conflict in my meeting ",
        "author": "danshipper",
        "date": "2025-04-16T17:01:08.000Z"
    },
    "sama1912564175253172356": {
        "content": "the ability of the new models to effectively use tools together has somehow really surprised me  intellectually i knew this was going to happen but it hits different to see it ",
        "author": "sama",
        "date": "2025-04-16T17:50:07.000Z"
    },
    "sama1912558996084650003": {
        "content": "\"at or near genius level\" ",
        "author": "sama",
        "date": "2025-04-16T17:29:32.000Z"
    },
    "deryatr_1912558350794961168": {
        "content": null,
        "author": "deryatr_",
        "date": null
    },
    "sama1912558745013612888": {
        "content": "we expect to release o3-pro to the pro tier in a few weeks ",
        "author": "sama",
        "date": "2025-04-16T17:28:33.000Z"
    },
    "sama1912558495997784441": {
        "content": "o3 and o4-mini are super good at coding, so we are releasing a new product, Codex CLI, to make them easier to use.  this is a coding agent that runs on your computer. it is fully open source and available today; we expect it to rapidly improve. ",
        "author": "sama",
        "date": "2025-04-16T17:27:33.000Z"
    },
    "sama1912558064739459315": {
        "content": "o3 and o4-mini are out!  they are very capable.  o4-mini is a ridiculously good deal for the price.  they can use and combine every tool within chatgpt.  multimodal understanding is particularly impressive. ",
        "author": "sama",
        "date": "2025-04-16T17:25:50.000Z"
    },
    "sama1912558100693107010": {
        "content": "details here: ",
        "author": "sama",
        "date": "2025-04-16T17:25:59.000Z"
    },
    "sama1912300398263824749": {
        "content": "the openai team is executing just ridiculously well at so many things right now, the coming months and years should be amazing  (a lotta stuff is messy and very broken too of course) ",
        "author": "sama",
        "date": "2025-04-16T00:21:58.000Z"
    },
    "sama1911910628232691947": {
        "content": "&gt;be you &gt;work in HFT shaving nanoseconds off latency or extracting bps from models &gt;have existential dread &gt;see this tweet, wonder if your skills could be better used making AGI &gt;apply to attend this party, meet the openai team &gt;build AGI ",
        "author": "sama",
        "date": "2025-04-14T22:33:10.000Z"
    },
    "sama1911910629188972708": {
        "content": null,
        "author": "sama",
        "date": "2025-04-14T22:33:10.000Z"
    },
    "sama1911906570835022319": {
        "content": "how about we fix our model naming by this summer and everyone gets a few more months to make fun of us (which we very much deserve) until then? ",
        "author": "sama",
        "date": "2025-04-14T22:17:02.000Z"
    },
    "itsclivetime1911852654214648019": {
        "content": "4.1 has basically replaced o3-mini for me in all my workflows (cursor, etc.) - highly recommend  also lol at nano just hanging out there being 2x better than latest 4o at math ",
        "author": "itsclivetime",
        "date": "2025-04-14T18:42:47.000Z"
    },
    "aidan_mclau1911850291026362426": {
        "content": "heard from some startup engineers that they lost several work hours gawking, stupefied, after they plugged 4.1 mini/nano into every previously-expensive part of their stack  you can just do gpt-4o-quality things 25 × cheaper now ",
        "author": "aidan_mclau",
        "date": "2025-04-14T18:33:24.000Z"
    },
    "sama1911830886896799931": {
        "content": "GPT-4.1 (and -mini and -nano) are now available in the API!  these models are great at coding, instruction following, and long context (1 million tokens).  benchmarks are strong, but we focused on real-world utility, and developers seem very happy.  GPT-4.1 family is API-only. ",
        "author": "sama",
        "date": "2025-04-14T17:16:18.000Z"
    },
    "sama1911832098572550648": {
        "content": "check out details and performance here! ",
        "author": "sama",
        "date": "2025-04-14T17:21:07.000Z"
    },
    "sama1911831955441582545": {
        "content": "many people worked on this, but  ",
        "author": "sama",
        "date": "2025-04-14T17:20:32.000Z"
    },
    "sama1911504090989035824": {
        "content": "if you are interested in infrastructure and very large-scale computing systems, the scale of what’s happening at openai right now is insane and we have very hard/interesting challenges.  please consider joining us! we could desperately use your help. ",
        "author": "sama",
        "date": "2025-04-13T19:37:43.000Z"
    },
    "sama1911504092276621801": {
        "content": "in particular, if you have thought about how to squeeze max performance out of a system, we'd love to talk to you.  and if you have a background in compiler design or programming language design, we might have something great for you. ",
        "author": "sama",
        "date": "2025-04-13T19:37:44.000Z"
    },
    "sama1911496563157000568": {
        "content": "we bought a lot of silly baby things that we haven't needed  but definitely i recommend a cradlewise crib and a lot more burp rags than you think you could possibly need ",
        "author": "sama",
        "date": "2025-04-13T19:07:49.000Z"
    },
    "sama1911490401221120284": {
        "content": "we've got a lot of good stuff for you this coming week!  kicking it off tomorrow. ",
        "author": "sama",
        "date": "2025-04-13T18:43:20.000Z"
    },
    "jesslivingston1911191235433533481": {
        "content": "I LOVED seeing summer '05 founders! \"Jessica Livingston, this is your life!\"  ",
        "author": "jesslivingston",
        "date": "2025-04-12T22:54:33.000Z"
    },
    "sama1910867196122931439": {
        "content": "super appreciate everyone who spent their evening with us yesterday; the feedback was very helpful. i think we will be able to deliver something great! ",
        "author": "sama",
        "date": "2025-04-12T01:26:56.000Z"
    },
    "sama1910861296217522610": {
        "content": "people loved the GPT-4.5 podcast!  what would you like to see one on next? ",
        "author": "sama",
        "date": "2025-04-12T01:03:29.000Z"
    },
    "sama1910843661123809627": {
        "content": "cute little robot ",
        "author": "sama",
        "date": "2025-04-11T23:53:25.000Z"
    },
    "sama1910800981429792878": {
        "content": "we have trained more models and they are good in some things ",
        "author": "sama",
        "date": "2025-04-11T21:03:49.000Z"
    },
    "sama1910363426972635455": {
        "content": "a lot of people were interested in how we made GPT-4.5 and what comes next.  we did a podcast with alex paino, dan selsam, and  ",
        "author": "sama",
        "date": "2025-04-10T16:05:08.000Z"
    },
    "sama1910502364236439842": {
        "content": "here is the full video: ",
        "author": "sama",
        "date": "2025-04-11T01:17:13.000Z"
    },
    "edwardsun09091910397369210069162": {
        "content": "We’re releasing BrowseComp, which stands for Browsing Competition.    Think of it like coding or math competitions — while these contests may not perfectly reflect real-world SWE or mathematical research, they do capture a spark of intelligence.  This is THE benchmark we should ",
        "author": "edwardsun0909",
        "date": "2025-04-10T18:20:00.000Z"
    },
    "sama1910398997333970984": {
        "content": "openai usage has gone nuts over the past month.  but a surprisingly cool thing is you can ask the internet \"hey can we please get hundreds of thousands of more GPUs quickly\" and...the internet will deliver.   ",
        "author": "sama",
        "date": "2025-04-10T18:26:29.000Z"
    },
    "sama1910399152888205347": {
        "content": "thank you all for the patience, and service speed and rate limits should continue to improve ",
        "author": "sama",
        "date": "2025-04-10T18:27:06.000Z"
    },
    "sama1910380643772665873": {
        "content": "we have greatly improved memory in chatgpt--it can now reference all your past conversations!  this is a surprisingly great feature imo, and it points at something we are excited about: ai systems that get to know you over your life, and become extremely useful and personalized. ",
        "author": "sama",
        "date": "2025-04-10T17:13:33.000Z"
    },
    "sama1910380644972265603": {
        "content": "rolls out today for pro users and soon for plus users.  (except users in the EEA, UK, switzerland, norway, iceland, and liechtenstein. call me, liechtenstein, let's work this out!) ",
        "author": "sama",
        "date": "2025-04-10T17:13:33.000Z"
    },
    "sama1910380646259974411": {
        "content": "you can of course opt out of this, or memory all together. and you can use temporary chat if you want to have a conversation that won't use or affect memory. ",
        "author": "sama",
        "date": "2025-04-10T17:13:33.000Z"
    },
    "sama1910363434241450171": {
        "content": null,
        "author": "sama",
        "date": "2025-04-10T16:05:10.000Z"
    },
    "sama1910363435558428821": {
        "content": null,
        "author": "sama",
        "date": "2025-04-10T16:05:10.000Z"
    },
    "sama1910334443690340845": {
        "content": "a few times a year i wake up early and can't fall back asleep because we are launching a new feature ive been so excited about for so long.  today is one of those days! ",
        "author": "sama",
        "date": "2025-04-10T14:09:58.000Z"
    },
    "bradlightcap1910019138493505783": {
        "content": "we're launching the openai pioneers program – a partnership between openai and companies building advanced ai products to (a) intensively fine-tune models that outperform at high value domain-specific tasks, and (b) build better real world evals that enable industries to better ",
        "author": "bradlightcap",
        "date": "2025-04-09T17:17:03.000Z"
    },
    "aleks_madry1909686225658695897": {
        "content": "If AGI is about AI transforming our economy—how close are we, really? What's still missing, and how do we get there?  OpenAI's new Strategic Deployment team tackles exactly these questions.  We push frontier models to be more capable, reliable, and aligned—then deploy them to ",
        "author": "aleks_madry",
        "date": "2025-04-08T19:14:11.000Z"
    },
    "sama1909233490908119177": {
        "content": "we have shipped a lot of stuff recently, but people really love this in particular: ",
        "author": "sama",
        "date": "2025-04-07T13:15:10.000Z"
    },
    "sama1908571040923730252": {
        "content": "i am really loving spending more with research and product  this is the most fun i've had since the early days when openai was just a quiet little research lab ",
        "author": "sama",
        "date": "2025-04-05T17:22:50.000Z"
    },
    "sama1908570592661692761": {
        "content": "just went through the list of what we are planning to launch in the next few months.  so much incredible stuff! ",
        "author": "sama",
        "date": "2025-04-05T17:21:03.000Z"
    },
    "eliza_luth1908538368536858784": {
        "content": "been asked about this so many times, stay tuned ",
        "author": "eliza_luth",
        "date": "2025-04-05T15:13:00.000Z"
    },
    "alexblania1907861647332618406": {
        "content": "it's been too long.   ",
        "author": "alexblania",
        "date": "2025-04-03T18:23:57.000Z"
    },
    "ren_hongyu1908035698579395066": {
        "content": "o3-mini-high helps accelerate scientific discovery  ",
        "author": "ren_hongyu",
        "date": "2025-04-04T05:55:34.000Z"
    },
    "sama1908167621624856998": {
        "content": "change of plans: we are going to release o3 and o4-mini after all, probably in a couple of weeks, and then do GPT-5 in a few months.  there are a bunch of reasons for this, but the most exciting one is that we are going to be able to make GPT-5 much better than we originally ",
        "author": "sama",
        "date": "2025-04-04T14:39:47.000Z"
    },
    "sama1908167790336651720": {
        "content": "we were able to really improve on what we previewed for o3 in many ways; i think people will be happy... ",
        "author": "sama",
        "date": "2025-04-04T14:40:27.000Z"
    },
    "sama1908163013192069460": {
        "content": "there are some books coming out about openai and me. we only participated in two—one by keach hagey focused on me, and one by ashlee vance on openai (the only author we’ve allowed behind-the-scenes and in meetings).  no book will get everything right, especially when some people ",
        "author": "sama",
        "date": "2025-04-04T14:21:28.000Z"
    },
    "sama1907932605888213491": {
        "content": "chatgpt has gotten way, way faster on the web!  lots of hard work from the team to make this happen. ",
        "author": "sama",
        "date": "2025-04-03T23:05:55.000Z"
    },
    "sama1907862982765457603": {
        "content": "chatgpt plus is free for college students in the US and canada through may! ",
        "author": "sama",
        "date": "2025-04-03T18:29:16.000Z"
    },
    "sama1907531078581272931": {
        "content": "prompt: sam altman as a cricket player in anime style ",
        "author": "sama",
        "date": "2025-04-02T20:30:24.000Z"
    },
    "sama1907451374809624813": {
        "content": "what's happening with ai adoption in india right now is amazing to watch.  we love to see the explosion of creativity--india is outpacing the world. ",
        "author": "sama",
        "date": "2025-04-02T15:13:41.000Z"
    },
    "sama1907224234277171677": {
        "content": null,
        "author": "sama",
        "date": "2025-04-02T00:11:06.000Z"
    },
    "sama1907207767062155478": {
        "content": "lol i feel like a YC founder in \"build in public\" mode again ",
        "author": "sama",
        "date": "2025-04-01T23:05:40.000Z"
    },
    "sama1907207515739435200": {
        "content": "y'all are not ready for images v2... ",
        "author": "sama",
        "date": "2025-04-01T23:04:40.000Z"
    },
    "sama1907155238555160615": {
        "content": "whatever.</span> ",
        "author": "sama",
        "date": "2025-04-01T19:36:56.000Z"
    },
    "sama1907117270427644074": {
        "content": "when the run name ends like this you know it's surely going to work this time  -restart-0331-final-final2-restart-forreal-omfg3 ",
        "author": "sama",
        "date": "2025-04-01T17:06:04.000Z"
    },
    "sama1907142749796831276": {
        "content": "ok that one didn't work but  -restart-0331-final-final2-restart-forreal-omfg3-YOLO  is gonna hit, i know it ",
        "author": "sama",
        "date": "2025-04-01T18:47:19.000Z"
    },
    "sama1907098207467032632": {
        "content": "we are getting things under control, but you should expect new releases from openai to be delayed, stuff to break, and for service to sometimes be slow as we deal with capacity challenges. ",
        "author": "sama",
        "date": "2025-04-01T15:50:19.000Z"
    },
    "sama1907098208821801222": {
        "content": "working as fast we can to really get stuff humming; if anyone has GPU capacity in 100k chunks we can get asap please call! ",
        "author": "sama",
        "date": "2025-04-01T15:50:19.000Z"
    },
    "sama1906867488320843823": {
        "content": "chatgpt image gen now rolled out to all free users! ",
        "author": "sama",
        "date": "2025-04-01T00:33:31.000Z"
    },
    "sama1906845532758405319": {
        "content": "we will not do anything silly like saying that you cant use our open model if your service has more than 700 million monthly active users.  we want everyone to use it! ",
        "author": "sama",
        "date": "2025-03-31T23:06:17.000Z"
    },
    "indiapostoffice1905204774191890837": {
        "content": "ChatGPT delivered the best    ",
        "author": "indiapostoffice",
        "date": "2025-03-27T10:26:29.000Z"
    },
    "sama1906810780005364133": {
        "content": null,
        "author": "sama",
        "date": "2025-03-31T20:48:11.000Z"
    },
    "joheidecke1906799330599813432": {
        "content": "Safety is a core focus of our open-weight model’s development, from pre-training to release. While open models bring unique challenges, we’re guided by our Preparedness Framework and will not release models we believe pose catastrophic risks. ",
        "author": "joheidecke",
        "date": "2025-03-31T20:02:41.000Z"
    },
    "sama1906793591944646898": {
        "content": "TL;DR: we are excited to release a powerful new open-weight language model with reasoning in the coming months, and we want to talk to devs about how to make it maximally useful:  ",
        "author": "sama",
        "date": "2025-03-31T19:39:53.000Z"
    },
    "sama1906771292390666325": {
        "content": "the chatgpt launch 26 months ago was one of the craziest viral moments i'd ever seen, and we added one million users in five days.  we added one million users in the last hour. ",
        "author": "sama",
        "date": "2025-03-31T18:11:16.000Z"
    },
    "sama1906210479695126886": {
        "content": "can yall please chill on generating images this is insane our team needs sleep ",
        "author": "sama",
        "date": "2025-03-30T05:02:48.000Z"
    },
    "rohanjamin1905721967216599199": {
        "content": "The 4o image gen demand has been absolutely incredible. Been super fun to watch the Sora feed fill up with great content .  Our GPUs are also melting in Sora land unfortunately so you may see longer wait times / capacity issues over coming days. We’ll be working hard to get back ",
        "author": "rohanjamin",
        "date": "2025-03-28T20:41:38.000Z"
    },
    "transitive_bs1905670939062538639": {
        "content": "if chatgpt were an n64 mario app ",
        "author": "transitive_bs",
        "date": "2025-03-28T17:18:52.000Z"
    },
    "sama1905622840306704787": {
        "content": "the gpt-4o update is GOOD ",
        "author": "sama",
        "date": "2025-03-28T14:07:44.000Z"
    },
    "sama1905419197120680193": {
        "content": "new version of GPT-4o particularly good at coding, instruction following, and freedom. ",
        "author": "sama",
        "date": "2025-03-28T00:38:32.000Z"
    },
    "sama1905349734879133801": {
        "content": "we updated GPT-4o! really big strides.  more updates to come. ",
        "author": "sama",
        "date": "2025-03-27T20:02:31.000Z"
    },
    "joannejang1905341734563053979": {
        "content": "// i lead model behavior at openai, and wanted to share some thoughts &amp; nuance that went into setting policy for 4o image generation.  features capital letters (!) bc i published it as a blog post:  -- This week, we launched native image generation in ChatGPT through 4o.  It was ",
        "author": "joannejang",
        "date": "2025-03-27T19:30:43.000Z"
    },
    "sama1905296867145154688": {
        "content": "it's super fun seeing people love images in chatgpt.  but our GPUs are melting.  we are going to temporarily introduce some rate limits while we work on making it more efficient. hopefully won't be long!  chatgpt free tier will get 3 generations per day soon. ",
        "author": "sama",
        "date": "2025-03-27T16:32:26.000Z"
    },
    "sama1905296868495826966": {
        "content": "(also, we are refusing some generations that should be allowed; we are fixing these as fast we can.) ",
        "author": "sama",
        "date": "2025-03-27T16:32:26.000Z"
    },
    "sama1905069374035411209": {
        "content": "believe it or not we put a lot of thought into the initial examples we show when we introduce new technology ",
        "author": "sama",
        "date": "2025-03-27T01:28:27.000Z"
    },
    "sama1905069027858448667": {
        "content": "just because you should doesnt mean you can ",
        "author": "sama",
        "date": "2025-03-27T01:27:05.000Z"
    },
    "sama1905061845532315936": {
        "content": "one man's slop is another man's treasure ",
        "author": "sama",
        "date": "2025-03-27T00:58:32.000Z"
    },
    "sama1905000759336620238": {
        "content": "images in chatgpt are wayyyy more popular than we expected (and we had pretty high expectations).  rollout to our free tier is unfortunately going to be delayed for awhile. ",
        "author": "sama",
        "date": "2025-03-26T20:55:48.000Z"
    },
    "sama1904957253456941061": {
        "content": "people love MCP and we are excited to add support across our products.  available today in the agents SDK and support for chatgpt desktop app + responses api coming soon! ",
        "author": "sama",
        "date": "2025-03-26T18:02:56.000Z"
    },
    "sama1904934112806187116": {
        "content": "changed my pfp but maybe someone will make me a better one ",
        "author": "sama",
        "date": "2025-03-26T16:30:59.000Z"
    },
    "sama1904921537884676398": {
        "content": "&gt;be me &gt;grind for a decade trying to help make superintelligence to cure cancer or whatever &gt;mostly no one cares for first 7.5 years, then for 2.5 years everyone hates you for everything &gt;wake up one day to hundreds of messages: \"look i made you into a twink ghibli style haha\" ",
        "author": "sama",
        "date": "2025-03-26T15:41:01.000Z"
    },
    "sama1904917997116153929": {
        "content": "tremendous alpha with images in chatgpt rn ",
        "author": "sama",
        "date": "2025-03-26T15:26:56.000Z"
    },
    "sama1904601193504268680": {
        "content": "the new version of images in chatgpt is still rolling out, so please try again later today if you dont get a great one :) ",
        "author": "sama",
        "date": "2025-03-25T18:28:04.000Z"
    },
    "sama1904598788687487422": {
        "content": "we are launching a new thing today—images in chatgpt!  two things to say about it:  1. it's an incredible technology/product. i remember seeing some of the first images come out of this model and having a hard time they were really made by AI. we think people will love it, and we ",
        "author": "sama",
        "date": "2025-03-25T18:18:31.000Z"
    },
    "sama1904599358756315341": {
        "content": "this was a real labor of love from  ",
        "author": "sama",
        "date": "2025-03-25T18:20:47.000Z"
    },
    "sama1902751101134438471": {
        "content": "there is a lot of wisdom in this thread.  joe coaches the research and compute teams at openai; i super enjoy working with him. one superpower is that he deeply understands emotional clarity and how to get there; this will be one of the most critical skills in a post-AGI world. ",
        "author": "sama",
        "date": "2025-03-20T15:56:28.000Z"
    },
    "sama1902413921778331785": {
        "content": "20 years ago, i was on a red-eye to meet jessica, pg, robert, and trevor to interview for the \"summer founders program\".  obviously i had no idea how much it would change my life. it was so fun to reminisce! ",
        "author": "sama",
        "date": "2025-03-19T17:36:38.000Z"
    },
    "sama1901295708608807104": {
        "content": "one of my best friends from high school made this song and it's so good! ",
        "author": "sama",
        "date": "2025-03-16T15:33:15.000Z"
    },
    "natesilver5381896213141350187336": {
        "content": "This is not as hard as it sounds (most matches are obvious, e.g. \"michigan-state\" and \"Michigan St\") but ChatGPT (o1) did this perfectly on the first try. Becoming a real time-saver for various data-wrangling tasks, even those that require contextual knowledge. ",
        "author": "natesilver538",
        "date": "2025-03-02T14:56:57.000Z"
    },
    "sama1900017208438505572": {
        "content": "i love riding caltrain! it's the best  ",
        "author": "sama",
        "date": "2025-03-13T02:52:57.000Z"
    },
    "caltrain1899844070014620128": {
        "content": null,
        "author": "caltrain",
        "date": null
    },
    "sama1899579431905305027": {
        "content": "this is a tremendous accomplishment from the team.  i am obviously biased but i think it's one of the most well-designed and useful APIs ever, and that people will really love it. ",
        "author": "sama",
        "date": "2025-03-11T21:53:23.000Z"
    },
    "sama1899549684668264779": {
        "content": "YC changed the startup ecosystem--maybe the whole tech industry--more than anything else over the past two decades. and the impact on many people's lives (including mine) has been astonishing.  what a happy photo. ",
        "author": "sama",
        "date": "2025-03-11T19:55:11.000Z"
    },
    "sama1899535815304454592": {
        "content": "!</span> ",
        "author": "sama",
        "date": "2025-03-11T19:00:04.000Z"
    },
    "openai1899143752918409338": {
        "content": null,
        "author": "openai",
        "date": null
    },
    "sama1899535387435086115": {
        "content": "we trained a new model that is good at creative writing (not sure yet how/when it will get released). this is the first time i have been really struck by something written by AI; it got the vibe of metafiction so right.  PROMPT:  Please write a metafictional literary short story ",
        "author": "sama",
        "date": "2025-03-11T18:58:22.000Z"
    },
    "sama1897348424984617215": {
        "content": "GPT-4.5 rollout to plus users has started  will complete within the next few days ",
        "author": "sama",
        "date": "2025-03-05T18:08:10.000Z"
    },
    "sama1897348503623623072": {
        "content": "i love this model ",
        "author": "sama",
        "date": "2025-03-05T18:08:28.000Z"
    },
    "sama1897081012003439079": {
        "content": "very proud of the openai team for what is perhaps the most impressive scientific/technical breakthrough of recent decades  thought that was the thing i'd always be most proud of in life  turns out i am now more proud of a preemie baby for learning how to eat on his own! ",
        "author": "sama",
        "date": "2025-03-05T00:25:33.000Z"
    },
    "sama1897081013362401777": {
        "content": "(i realize i am getting neurochemically hacked here but idc, it's the best) ",
        "author": "sama",
        "date": "2025-03-05T00:25:34.000Z"
    },
    "sama1897065339617468918": {
        "content": "we are likely going to roll out GPT-4.5 to the plus tier over a few days.  there is no perfect way to do this; we wanted to do it for everyone tomorrow, but it would have meant we had to launch with a very low rate limit.  we think people are gonna use this a lot and love it. ",
        "author": "sama",
        "date": "2025-03-04T23:23:17.000Z"
    },
    "sama1897065340577964369": {
        "content": "so we think it's better to let people have real, long conversations with it, but that means we have to stagger people in rather than have everyone hit it hard a the same time.  hope that makes sense and look forward to seeing your feedback! ",
        "author": "sama",
        "date": "2025-03-04T23:23:17.000Z"
    },
    "sama1897036361506689206": {
        "content": "an idea for paid plans: your $20 plus subscription converts to credits you can use across features like deep research, o1, gpt-4.5, sora, etc.  no fixed limits per feature and you choose what you want; if you run out of credits you can buy more.  what do you think? good/bad? ",
        "author": "sama",
        "date": "2025-03-04T21:28:08.000Z"
    },
    "sama1896967655841783995": {
        "content": "excited for this--advancing research and education with AI ",
        "author": "sama",
        "date": "2025-03-04T16:55:07.000Z"
    },
    "sama1896651354648818121": {
        "content": "!!</span> ",
        "author": "sama",
        "date": "2025-03-03T19:58:15.000Z"
    },
    "sama1896652239202365550": {
        "content": "!!!</span> ",
        "author": "sama",
        "date": "2025-03-03T20:01:46.000Z"
    },
    "sama1896649668387541128": {
        "content": "once in awhile the high taste testers are right ",
        "author": "sama",
        "date": "2025-03-03T19:51:33.000Z"
    },
    "sama1896231850093551878": {
        "content": "GPT-4.5 is the first time people have been emailing with such passion asking us to promise to never stop offering a specific model or even replace it with an update  great work  ",
        "author": "sama",
        "date": "2025-03-02T16:11:18.000Z"
    },
    "rohanjamin1895353378647220565": {
        "content": "OK YOU CAN TRY IT NOW ",
        "author": "rohanjamin",
        "date": "2025-02-28T06:00:34.000Z"
    },
    "sama1895490123690922445": {
        "content": "it's very hard to get the math and ML right on a run as big as GPT-4.5, and requires difficult work at the intersection of ML and systems.   ",
        "author": "sama",
        "date": "2025-02-28T15:03:56.000Z"
    },
    "sama1895230925753233763": {
        "content": "ok fine maybe we'll do a social app ",
        "author": "sama",
        "date": "2025-02-27T21:53:59.000Z"
    },
    "sama1895232244354294117": {
        "content": "lol if facebook tries to come at us and we just uno reverse them it would be so funny  ",
        "author": "sama",
        "date": "2025-02-27T21:59:13.000Z"
    },
    "sama1895203654103351462": {
        "content": "GPT-4.5 is ready!  good news: it is the first model that feels like talking to a thoughtful person to me. i have had several moments where i've sat back in my chair and been astonished at getting actually good advice from an AI.  bad news: it is a giant, expensive model. we ",
        "author": "sama",
        "date": "2025-02-27T20:05:36.000Z"
    },
    "openai1894495906952876101": {
        "content": "Starting today, we’re rolling out a version of Advanced Voice powered by GPT-4o mini to give all ChatGPT free users a chance to preview it daily across platforms.  The natural conversation pace and tone are similar to the GPT-4o version while being more cost effective to serve. ",
        "author": "openai",
        "date": "2025-02-25T21:13:16.000Z"
    },
    "sama1894527988378550392": {
        "content": "deep research out for chatgpt plus users!  one of my favorite things we have ever shipped. ",
        "author": "sama",
        "date": "2025-02-25T23:20:45.000Z"
    },
    "sama1893423520866033865": {
        "content": "welcome to the world, little guy!  he came early and is going to be in the nicu for awhile. he is doing well and it’s really nice to be in a little bubble taking care of him.  i have never felt such love. ",
        "author": "sama",
        "date": "2025-02-22T22:12:00.000Z"
    },
    "sama1891667332105109653": {
        "content": "for our next open source project, would it be more useful to do an o3-mini level model that is pretty small but still needs to run on GPUs, or the best phone-sized model we can do? ",
        "author": "sama",
        "date": "2025-02-18T01:53:32.000Z"
    },
    "sama1891533802779910471": {
        "content": "trying GPT-4.5 has been much more of a \"feel the AGI\" moment among high-taste testers than i expected! ",
        "author": "sama",
        "date": "2025-02-17T17:02:56.000Z"
    },
    "sama1890820962993533232": {
        "content": "i particularly love when the anti-AI crowd makes up shit about our water usage while eating a hamburger ",
        "author": "sama",
        "date": "2025-02-15T17:50:21.000Z"
    },
    "sama1890816782836904000": {
        "content": "we put out an update to chatgpt (4o).  it is pretty good.  it is soon going to get much better, team is cooking. ",
        "author": "sama",
        "date": "2025-02-15T17:33:45.000Z"
    },
    "sullyomarr1890420234340745365": {
        "content": "gpt-4o’s latest update on chatgpt made its writing unbelievably good  way more human like, better at writing (emails, scripts, marketing etc) &amp; actually follows style guides, esp with examples  first time a model writes without sounding like slop (even better than claude) ",
        "author": "sullyomarr",
        "date": "2025-02-14T15:18:00.000Z"
    },
    "bayeslord1890644014916915227": {
        "content": "gpt4o rn is like if Sydney was way smarter, went to therapy for 100 years, and learned to vibe out ",
        "author": "bayeslord",
        "date": "2025-02-15T06:07:14.000Z"
    },
    "alexwei_1889727569421087217": {
        "content": "o3 x competitive programming update from the OpenAI reasoning team!    Back in August, we sprinted to prepare o1 to compete in the 2024 International Olympiad in Informatics ... ",
        "author": "alexwei_",
        "date": "2025-02-12T17:25:36.000Z"
    },
    "openai1889822643676913977": {
        "content": "Two updates you'll like—    OpenAI o1 and o3-mini now support both file &amp; image uploads in ChatGPT    We raised o3-mini-high limits by 7x for Plus users to up to 50 per day ",
        "author": "openai",
        "date": "2025-02-12T23:43:24.000Z"
    },
    "sama1889789507492520342": {
        "content": "really proud of this work: ",
        "author": "sama",
        "date": "2025-02-12T21:31:43.000Z"
    },
    "sama1889755723078443244": {
        "content": "OPENAI ROADMAP UPDATE FOR GPT-4.5 and GPT-5:  We want to do a better job of sharing our intended roadmap, and a much better job simplifying our product offerings.  We want AI to “just work” for you; we realize how complicated our model and product offerings have gotten.  We hate ",
        "author": "sama",
        "date": "2025-02-12T19:17:29.000Z"
    },
    "sama1889679679696806103": {
        "content": "i think we are going to initially offer 10 uses per month for chatgpt plus and 2 per month in the free tier, with the intent to scale these up over time.  it probably is worth $1000 a month to some users but i'm excited to see what everyone does with it! ",
        "author": "sama",
        "date": "2025-02-12T14:15:18.000Z"
    },
    "sama1889679681047482730": {
        "content": "longer-term we still have to find some way to let people to pay for compute they want to use more dynamically.  we have been really struck by the demand from some users to hit deep research dozens of times per day. ",
        "author": "sama",
        "date": "2025-02-12T14:15:19.000Z"
    },
    "sama1889059531625464090": {
        "content": "no thank you but we will buy twitter for $9.74 billion if you want ",
        "author": "sama",
        "date": "2025-02-10T21:11:04.000Z"
    },
    "sama1888772188758593651": {
        "content": "an ode to the history of technology, and human potential: ",
        "author": "sama",
        "date": "2025-02-10T02:09:16.000Z"
    },
    "sama1888703820596977684": {
        "content": "man, still a long way to go to run down google  ",
        "author": "sama",
        "date": "2025-02-09T21:37:35.000Z"
    },
    "sama1888695926484611375": {
        "content": "Three Observations: ",
        "author": "sama",
        "date": "2025-02-09T21:06:13.000Z"
    },
    "sama1887685211414007908": {
        "content": "chains of thought for o3-mini!  (we try to organize the raw CoT to make it more readable, and optionally to translate languages, but we try to keep it quite faithful to the raw one)  great work from  ",
        "author": "sama",
        "date": "2025-02-07T02:10:00.000Z"
    },
    "sama1887431071190396939": {
        "content": "make search great again ",
        "author": "sama",
        "date": "2025-02-06T09:20:08.000Z"
    },
    "neelajj1887143916404716024": {
        "content": "Wasn’t our fault but we fixed it anyways. Deep research is now live in the EU and UK! ",
        "author": "neelajj",
        "date": "2025-02-05T14:19:05.000Z"
    },
    "sama1886559648158826518": {
        "content": "glad to hear this; excited to bring soon to plus/free tiers! ",
        "author": "sama",
        "date": "2025-02-03T23:37:25.000Z"
    },
    "sama1886424331242348743": {
        "content": "when we launched the openai pro plan in december i thought it was only a good deal for extreme power users.  now with the addition of 100 deep research queries per month, unlimited sora, unlimited chatgpt, o1 pro and more stuff to come, i think it is a great deal for many users! ",
        "author": "sama",
        "date": "2025-02-03T14:39:43.000Z"
    },
    "sama1886424744297365534": {
        "content": "and operator! ",
        "author": "sama",
        "date": "2025-02-03T14:41:21.000Z"
    },
    "sama1886424335042355384": {
        "content": "unless you live in europe/the uk, but that’s not our fault :( ",
        "author": "sama",
        "date": "2025-02-03T14:39:44.000Z"
    },
    "sama1886220053219069995": {
        "content": "this version will have something like 10/month in our plus tier and a very small number in our plus tier, but we are working on a more efficient version.  (this version is built on o3.) ",
        "author": "sama",
        "date": "2025-02-03T01:07:59.000Z"
    },
    "sama1886222929458835845": {
        "content": "argh, a very small number in our *free* tier, sorry ",
        "author": "sama",
        "date": "2025-02-03T01:19:25.000Z"
    },
    "sama1886222189269065758": {
        "content": "50 cents of compute for 500 dollars of value ",
        "author": "sama",
        "date": "2025-02-03T01:16:28.000Z"
    },
    "sama1886221586002489634": {
        "content": "(note: this is not the \"one-more-thing\" for o3-mini. few more days for that.) ",
        "author": "sama",
        "date": "2025-02-03T01:14:05.000Z"
    },
    "deryatr_1886208112245227743": {
        "content": "I can finally reveal that I’ve had early access to  ",
        "author": "deryatr_",
        "date": "2025-02-03T00:20:32.000Z"
    },
    "sama1886220904088162729": {
        "content": "congrats to the team, especially  ",
        "author": "sama",
        "date": "2025-02-03T01:11:22.000Z"
    },
    "sama1886220281565381078": {
        "content": "way back on friday, the high score on \"humanity's last exam\" was o3-mini-high at 13%.  now on sunday, deep research gets 26.6%. ",
        "author": "sama",
        "date": "2025-02-03T01:08:54.000Z"
    },
    "sama1886220055521997117": {
        "content": "give it a try on your hardest work task that can be solved just by using the internet and see what happens. ",
        "author": "sama",
        "date": "2025-02-03T01:08:00.000Z"
    },
    "sama1885601623625331162": {
        "content": "got one more o3-mini goody coming for you soon--i think we saved the best for last! ",
        "author": "sama",
        "date": "2025-02-01T08:10:34.000Z"
    },
    "sama1885565392472481918": {
        "content": "soon we will need another exam... ",
        "author": "sama",
        "date": "2025-02-01T05:46:36.000Z"
    },
    "sama1885512831056986575": {
        "content": "o3-mini-high is really good and it's cool to hear some people say it's their favorite model ever  but  it reminds me of when we used to have something internally called \"the little big run\"  a top 2025 goal is to fix our naming problem ",
        "author": "sama",
        "date": "2025-02-01T02:17:44.000Z"
    },
    "sama1885443487253848512": {
        "content": "check out how more details here, especially worth noting the performance of high.  also, team really delivered on API pricing! ",
        "author": "sama",
        "date": "2025-01-31T21:42:11.000Z"
    },
    "sama1885441031656632737": {
        "content": "o3-mini is out!  smart, fast model.  available in ChatGPT and API.  it can search the web, and it shows its thinking.  available to free-tier users! click the \"reason\" button.  with ChatGPT plus, you can select \"o3-mini-high\", which thinks harder and gives better answers. ",
        "author": "sama",
        "date": "2025-01-31T21:32:26.000Z"
    },
    "sama1885441438579601456": {
        "content": "a lot of people prefer this to o1, and it's just the mini model.  now we work on the big brother. ",
        "author": "sama",
        "date": "2025-01-31T21:34:03.000Z"
    },
    "sama1885218481282388148": {
        "content": "why not 100x? ",
        "author": "sama",
        "date": "2025-01-31T06:48:06.000Z"
    },
    "sama1885191346916356371": {
        "content": "first full 8-rack GB200 NVL72 now running in azure for openai—thank you  ",
        "author": "sama",
        "date": "2025-01-31T05:00:16.000Z"
    },
    "sama1884374900908884171": {
        "content": "visited  ",
        "author": "sama",
        "date": "2025-01-28T22:56:01.000Z"
    },
    "sama1884319395905958235": {
        "content": "next phase of the msft x oai partnership is gonna be much better than anyone is ready for!! ",
        "author": "sama",
        "date": "2025-01-28T19:15:27.000Z"
    }
}