{
    "secduffynasa1972427529186312680": {
        "content": "I’m here in Sydney at the 76th International Aeronautical Congress where I’ll be meeting with global space leaders this week.    Follow along this week to see how we’re ensuring American dominance in space.  ",
        "author": "secduffynasa",
        "date": "2025-09-28T22:25:43.000Z"
    },
    "secduffynasa1970574937023746469": {
        "content": "A Virtual Astronaut Tissue Analog Response (AVATARs) for astronaut health are flying around the Moon - ANOTHER FIRST for America!    This experiment will study the impact of deep space on human cells which will lead the way for astronauts to thrive in the final frontier - from ",
        "author": "secduffynasa",
        "date": "2025-09-23T19:44:11.000Z"
    },
    "secduffynasa1968769858491007402": {
        "content": "I want YOU to follow along with us as we announce  ",
        "author": "secduffynasa",
        "date": "2025-09-18T20:11:26.000Z"
    },
    "secduffynasa1964022425722511489": {
        "content": "The 400th episode of Houston We Have a Podcast is out TODAY!  We talk about our missions to the Moon and Mars in order to achieve President Trump’s goal of U.S. space dominance.  Give it a listen below  ",
        "author": "secduffynasa",
        "date": "2025-09-05T17:46:50.000Z"
    },
    "secduffynasa1963991678114480161": {
        "content": "We will get to the Moon under President Trump’s term. Our mission is Artemis.  We WILL win the second space race. China wants to beat us there, but we won’t let them.  Come aboard, to the final frontier. ",
        "author": "secduffynasa",
        "date": "2025-09-05T15:44:39.000Z"
    },
    "secduffynasa1952718566030966818": {
        "content": "What we learn on these missions is what’s going to get us to the Moon… and then onward to Mars. ",
        "author": "secduffynasa",
        "date": "2025-08-05T13:09:20.000Z"
    },
    "secduffynasa1948507387955995107": {
        "content": "56 years ago, American legends Armstrong, Aldrin, &amp; Collins came home after planting our flag on the Moon—showing the world what AMERICAN GREATNESS truly means.    Thanks to President Trump, we’re going back to the Moon—this time to stay. Next stop: MARS. ",
        "author": "secduffynasa",
        "date": "2025-07-24T22:15:37.000Z"
    },
    "secduffynasa1948491315735392579": {
        "content": "Today, following a July 9th meeting of Senegal President Bassirou Diomaye Faye with President Trump, the Senegalese Agency for Space Studies Miram Kaïré became the 56th signatory of the Artemis Accords  At  ",
        "author": "secduffynasa",
        "date": "2025-07-24T21:11:45.000Z"
    },
    "secduffynasa1946351031287443529": {
        "content": null,
        "author": "secduffynasa",
        "date": null
    }
}